itzandroidtab/klib-svd/lpc1756.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>TIMER0</name>
			<description>Timer0/1/2/3  </description>
			<groupName>TIMER0</groupName>
			<baseAddress>0x40004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIMER0</name>
				<value>1</value>
			</interrupt>
			<registers>
				<register>
					<name>IR</name>
					<description>Interrupt Register. The IR can be written to clear interrupts. The IR can be read to identify which of eight possible interrupt sources are pending.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MR0INT</name>
							<description>Interrupt flag for match channel 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>MR1INT</name>
							<description>Interrupt flag for match channel 1.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>MR2INT</name>
							<description>Interrupt flag for match channel 2.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>MR3INT</name>
							<description>Interrupt flag for match channel 3.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CR0INT</name>
							<description>Interrupt flag for capture channel 0 event.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CR1INT</name>
							<description>Interrupt flag for capture channel 1 event.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TCR</name>
					<description>Timer Control Register. The TCR is used to control the Timer Counter functions. The Timer Counter can be disabled or reset through the TCR.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CEN</name>
							<description>When one, the Timer Counter and Prescale Counter are enabled for counting. When zero, the counters are disabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CRST</name>
							<description>When one, the Timer Counter and the Prescale Counter are synchronously reset on the next positive edge of PCLK. The counters remain reset until TCR[1] is returned to zero.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TC</name>
					<description>Timer Counter. The 32 bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TC</name>
							<description>Timer counter value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PR</name>
					<description>Prescale Register. When the Prescale Counter (PC) is equal to this value, the next clock increments the TC and clears the PC.</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PM</name>
							<description>Prescale counter maximum value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PC</name>
					<description>Prescale Counter. The 32 bit PC is a counter which is incremented to the value stored in PR. When the value in PR is reached, the TC is incremented and the PC is cleared. The PC is observable and controllable through the bus interface.</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PC</name>
							<description>Prescale counter value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MCR</name>
					<description>Match Control Register. The MCR is used to control if an interrupt is generated and if the TC is reset when a Match occurs.</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MR0I</name>
							<description>Interrupt on MR0</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_IS_GENERAT</name>
									<description>Interrupt is generated when MR0 matches the value in the TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_IS_DISABLE</name>
									<description>Interrupt is disabled</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MR0R</name>
							<description>Reset on MR0</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TC_WILL_BE_RESET_IF_</name>
									<description>TC will be reset if MR0 matches it.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FEATURE_DISABLED_</name>
									<description>Feature disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MR0S</name>
							<description>Stop on MR0</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TC_AND_PC_WILL_BE_ST</name>
									<description>TC and PC will be stopped and TCR[0] will be set to 0 if MR0 matches the TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FEATURE_DISABLED_</name>
									<description>Feature disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MR1I</name>
							<description>Interrupt on MR1</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_IS_GENERAT</name>
									<description>Interrupt is generated when MR1 matches the value in the TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_IS_DISABLE</name>
									<description>Interrupt is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MR1R</name>
							<description>Reset on MR1</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TC_WILL_BE_RESET_IF_</name>
									<description>TC will be reset if MR1 matches it.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FEATURE_DISABLED_</name>
									<description>Feature disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MR1S</name>
							<description>Stop on MR1</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TC_AND_PC_WILL_BE_ST</name>
									<description>TC and PC will be stopped and TCR[0] will be set to 0 if MR1 matches the TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FEATURE_DISABLED_</name>
									<description>Feature disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MR2I</name>
							<description>Interrupt on MR2</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_IS_GENERAT</name>
									<description>Interrupt is generated when MR2 matches the value in the TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_IS_DISABLE</name>
									<description>Interrupt is disabled</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MR2R</name>
							<description>Reset on MR2</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TC_WILL_BE_RESET_IF_</name>
									<description>TC will be reset if MR2 matches it.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FEATURE_DISABLED_</name>
									<description>Feature disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MR2S</name>
							<description>Stop on MR2.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TC_AND_PC_WILL_BE_ST</name>
									<description>TC and PC will be stopped and TCR[0] will be set to 0 if MR2 matches the TC</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FEATURE_DISABLED_</name>
									<description>Feature disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MR3I</name>
							<description>Interrupt on MR3</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_IS_GENERAT</name>
									<description>Interrupt is generated when MR3 matches the value in the TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_INTERRUPT_IS_DI</name>
									<description>This interrupt is disabled</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MR3R</name>
							<description>Reset on MR3</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TC_WILL_BE_RESET_IF_</name>
									<description>TC will be reset if MR3 matches it.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FEATURE_DISABLED_</name>
									<description>Feature disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MR3S</name>
							<description>Stop on MR3</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TC_AND_PC_WILL_BE_ST</name>
									<description>TC and PC will be stopped and TCR[0] will be set to 0 if MR3 matches the TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FEATURE_DISABLED_</name>
									<description>Feature disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>MR[%s]</name>
					<displayName>MR[%s]</displayName>
					<description>Match Register 0. MR0 can be enabled through the MCR to reset the TC, stop both the TC and PC, and/or generate an interrupt every time MR0 matches the TC.</description>
					<addressOffset>0x018</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATCH</name>
							<description>Timer counter match value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Capture Control Register. The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated when a capture takes place.</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP0RE</name>
							<description>Capture on CAPn.0 rising edge</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A sequence of 0 then 1 on CAPn.0 will cause CR0 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP0FE</name>
							<description>Capture on CAPn.0 falling edge</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A sequence of 1 then 0 on CAPn.0 will cause CR0 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP0I</name>
							<description>Interrupt on CAPn.0 event</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A CR0 load due to a CAPn.0 event will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1RE</name>
							<description>Capture on CAPn.1 rising edge</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A sequence of 0 then 1 on CAPn.1 will cause CR1 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1FE</name>
							<description>Capture on CAPn.1 falling edge</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A sequence of 1 then 0 on CAPn.1 will cause CR1 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1I</name>
							<description>Interrupt on CAPn.1 event</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>A CR1 load due to a CAPn.1 event will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>CR[%s]</name>
					<displayName>CR[%s]</displayName>
					<description>Capture Register 0. CR0 is loaded with the value of TC when there is an event on the CAPn.0 input.</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP</name>
							<description>Timer counter capture value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
