itzandroidtab/klib-svd/lpc1756.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="TIMER0">
			<name>TIMER1</name>
			<baseAddress>0x40008000</baseAddress>
			<interrupt>
				<name>TIMER1</name>
				<value>2</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>UART0</name>
			<description>UART0/2/3  </description>
			<groupName>UART0</groupName>
			<baseAddress>0x4000C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART0</name>
				<value>5</value>
			</interrupt>
			<registers>
				<register>
					<name>RBR</name>
					<description>Receiver Buffer Register. Contains the next received character to be read (DLAB =0).</description>
					<addressOffset>0x000</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<readAction>modify</readAction>
					<fields>
						<field>
							<name>RBR</name>
							<description>The UARTn Receiver Buffer Register contains the oldest received byte in the UARTn Rx FIFO.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, the value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>THR</name>
					<description>Transmit Holding Regiter. The next character to be transmitted is written here (DLAB =0).</description>
					<alternateRegister>RBR</alternateRegister>
					<addressOffset>0x000</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Writing to the UARTn Transmit Holding Register causes the data to be stored in the UARTn transmit FIFO. The byte will be sent when it reaches the bottom of the FIFO and the transmitter is available.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DLL</name>
					<description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider (DLAB =1).</description>
					<alternateRegister>RBR</alternateRegister>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x01</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLLSB</name>
							<description>The UARTn Divisor Latch LSB Register, along with the UnDLM register, determines the baud rate of the UARTn.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DLM</name>
					<description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider (DLAB =1).</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLMSB</name>
							<description>The UARTn Divisor Latch MSB Register, along with the U0DLL register, determines the baud rate of the UARTn.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART interrupts (DLAB =0).</description>
					<alternateRegister>DLM</alternateRegister>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RBRIE</name>
							<description>RBR Interrupt Enable. Enables the Receive Data Available interrupt for UARTn. It also controls the Character Receive Time-out interrupt.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_THE_RDA_INTE</name>
									<description>Disable the RDA interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_THE_RDA_INTER</name>
									<description>Enable the RDA interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>THREIE</name>
							<description>THRE Interrupt Enable. Enables the THRE interrupt for UARTn. The status of this can be read from UnLSR[5].</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_THE_THRE_INT</name>
									<description>Disable the THRE interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_THE_THRE_INTE</name>
									<description>Enable the THRE interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXIE</name>
							<description>RX Line Status Interrupt Enable. Enables the UARTn RX line status interrupts. The status of this interrupt can be read from UnLSR[4:1].</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_THE_RX_LINE_</name>
									<description>Disable the RX line status interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_THE_RX_LINE_S</name>
									<description>Enable the RX line status interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[7:3]</bitRange>
						</field>
						<field>
							<name>ABEOINTEN</name>
							<description>Enables the end of auto-baud interrupt.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_END_OF_AUTO_</name>
									<description>Disable end of auto-baud Interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_END_OF_AUTO_B</name>
									<description>Enable end of auto-baud Interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ABTOINTEN</name>
							<description>Enables the auto-baud time-out interrupt.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_AUTO_BAUD_TI</name>
									<description>Disable auto-baud time-out Interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_AUTO_BAUD_TIM</name>
									<description>Enable auto-baud time-out Interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IIR</name>
					<description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-only</access>
					<resetValue>0x01</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTSTATUS</name>
							<description>Interrupt status. Note that UnIIR[0] is active low. The pending interrupt can be determined by evaluating UnIIR[3:1].</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AT_LEAST_ONE_INTERRU</name>
									<description>At least one interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_INTERRUPT_IS_PEND</name>
									<description>No interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INTID</name>
							<description>Interrupt identification. UnIER[3:1] identifies an interrupt corresponding to the UARTn Rx or TX FIFO. All other combinations of UnIER[3:1] not listed below are reserved (000,100,101,111).</description>
							<bitRange>[3:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>1_RECEIVE_LINE_S</name>
									<description>1   - Receive Line Status (RLS).</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2A__RECEIVE_DATA_AV</name>
									<description>2a - Receive Data Available (RDA).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2B__CHARACTER_TIME_</name>
									<description>2b - Character Time-out Indicator (CTI).</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_THRE_INTERRUPT</name>
									<description>3   - THRE Interrupt</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[5:4]</bitRange>
						</field>
						<field>
							<name>FIFOENABLE</name>
							<description>Copies of UnFCR[0].</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>ABEOINT</name>
							<description>End of auto-baud interrupt. True if auto-baud has finished successfully and interrupt is enabled.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>ABTOINT</name>
							<description>Auto-baud time-out interrupt. True if auto-baud has timed out and interrupt is enabled.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FCR</name>
					<description>FIFO Control Register. Controls UART FIFO usage and modes.</description>
					<alternateRegister>IIR</alternateRegister>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FIFOEN</name>
							<description>FIFO Enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>UARTN_FIFOS_ARE_DISA</name>
									<description>UARTn FIFOs are disabled. Must not be used in the application.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH_ENABLE_F</name>
									<description>Active high enable for both UARTn Rx and TX FIFOs and UnFCR[7:1] access. This bit must be set for proper UART operation. Any transition on this bit will automatically clear the related UART FIFOs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXFIFORES</name>
							<description>RX FIFO Reset.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_IMPACT_ON_EITHER_</name>
									<description>No impact on either of UARTn FIFOs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITING_A_LOGIC_1_TO</name>
									<description>Writing a logic 1 to UnFCR[1] will clear all bytes in UARTn Rx FIFO, reset the pointer logic. This bit is self-clearing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXFIFORES</name>
							<description>TX FIFO Reset.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_IMPACT_ON_EITHER_</name>
									<description>No impact on either of UARTn FIFOs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITING_A_LOGIC_1_TO</name>
									<description>Writing a logic 1 to UnFCR[2] will clear all bytes in UARTn TX FIFO, reset the pointer logic. This bit is self-clearing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAMODE</name>
							<description>DMA Mode Select. When the FIFO enable (bit 0 of this register) is set, this bit selects the DMA mode. See Section 18.6.6.1.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[5:4]</bitRange>
						</field>
						<field>
							<name>RXTRIGLVL</name>
							<description>RX Trigger Level. These two bits determine how many receiver UARTn FIFO characters must be written before an interrupt or DMA request is activated.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TRIGGER_LEVEL_0_1_C</name>
									<description>Trigger level 0 (1 character or 0x01).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRIGGER_LEVEL_1_4_C</name>
									<description>Trigger level 1 (4 characters or 0x04).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRIGGER_LEVEL_2_8_C</name>
									<description>Trigger level 2 (8 characters or 0x08).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRIGGER_LEVEL_3_14_</name>
									<description>Trigger level 3 (14 characters or 0x0E).</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>LCR</name>
					<description>Line Control Register. Contains controls for frame formatting and break generation.</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WLS</name>
							<description>Word Length Select.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>5_BIT_CHARACTER_LENG</name>
									<description>5-bit character length</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_BIT_CHARACTER_LENG</name>
									<description>6-bit character length</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_BIT_CHARACTER_LENG</name>
									<description>7-bit character length</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_BIT_CHARACTER_LENG</name>
									<description>8-bit character length</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SBS</name>
							<description>Stop Bit Select</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>1_STOP_BIT_</name>
									<description>1 stop bit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_STOP_BITS_1_5_IF_</name>
									<description>2 stop bits (1.5 if UnLCR[1:0]=00).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PE</name>
							<description>Parity Enable.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_PARITY_GENER</name>
									<description>Disable parity generation and checking.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_PARITY_GENERA</name>
									<description>Enable parity generation and checking.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PS</name>
							<description>Parity Select</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ODD_PARITY_NUMBER_O</name>
									<description>Odd parity. Number of 1s in the transmitted character and the attached parity bit will be odd.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EVEN_PARITY_NUMBER_</name>
									<description>Even Parity. Number of 1s in the transmitted character and the attached parity bit will be even.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCED_1_STICK_PARIT</name>
									<description>Forced 1 stick parity.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCED_0_STICK_PARIT</name>
									<description>Forced 0 stick parity.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BC</name>
							<description>Break Control</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_BREAK_TRANSM</name>
									<description>Disable break transmission.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_BREAK_TRANSMI</name>
									<description>Enable break transmission. Output pin UARTn TXD is forced to logic 0 when UnLCR[6] is active high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLAB</name>
							<description>Divisor Latch Access Bit</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_ACCESS_TO_DI</name>
									<description>Disable access to Divisor Latches.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_ACCESS_TO_DIV</name>
									<description>Enable access to Divisor Latches.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
