itzandroidtab/klib-svd/lpc1756.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PWM1</name>
			<description>Pulse Width Modulators (PWM1) </description>
			<groupName>PWM</groupName>
			<baseAddress>0x40018000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PWM1</name>
				<value>9</value>
			</interrupt>
			<registers>
				<register>
					<name>IR</name>
					<description>Interrupt Register. The IR can be written to clear interrupts, or read to identify which PWM interrupt sources are pending.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PWMMR0INT</name>
							<description>Interrupt flag for PWM match channel 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>PWMMR1INT</name>
							<description>Interrupt flag for PWM match channel 1.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>PWMMR2INT</name>
							<description>Interrupt flag for PWM match channel 2.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>PWMMR3INT</name>
							<description>Interrupt flag for PWM match channel 3.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>PWMCAP0INT</name>
							<description>Interrupt flag for capture input 0</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>PWMCAP1INT</name>
							<description>Interrupt flag for capture input 1 (available in PWM1IR only; this bit is reserved in PWM0IR).</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>PWMMR4INT</name>
							<description>Interrupt flag for PWM match channel 4.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>PWMMR5INT</name>
							<description>Interrupt flag for PWM match channel 5.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>PWMMR6INT</name>
							<description>Interrupt flag for PWM match channel 6.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TCR</name>
					<description>Timer Control Register. The TCR is used to control the Timer Counter functions.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CE</name>
							<description>Counter Enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_TIMER_COUNTE</name>
									<description>The PWM Timer Counter and PWM Prescale Counter are enabled for counting.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_COUNTERS_ARE_DIS</name>
									<description>The counters are disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CR</name>
							<description>Counter Reset</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_TIMER_COUNTE</name>
									<description>The PWM Timer Counter and the PWM Prescale Counter are synchronously reset on the next positive edge of PCLK. The counters remain reset until this bit is returned to zero.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_RESET_</name>
									<description>Clear reset.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>PWMEN</name>
							<description>PWM Enable</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PWM_MODE_IS_ENABLED_</name>
									<description>PWM mode is enabled (counter resets to 1). PWM mode causes the shadow registers to operate in connection with the Match registers. A program write to a Match register will not have an effect on the Match result until the corresponding bit in PWMLER has been set, followed by the occurrence of a PWM Match 0 event. Note that the PWM Match register that determines the PWM rate (PWM Match Register 0 - MR0) must be set up prior to the PWM being enabled. Otherwise a Match event will not occur to cause shadow register contents to become effective.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER_MODE_IS_ENABLE</name>
									<description>Timer mode is enabled (counter resets to 0).</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MDIS</name>
							<description>Master Disable (PWM0 only). The two PWMs may be synchronized using the Master Disable control bit. The Master disable bit of the Master PWM (PWM0 module) controls a secondary enable input to both PWMs, as shown in Figure 141.  This bit has no function in the Slave PWM (PWM1).</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MASTER_USE_PWM0_IS_</name>
									<description>Master use. PWM0 is the master, and both PWMs are enabled for counting.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INDIVIDUAL_USE_THE_</name>
									<description>Individual use. The PWMs are used independently, and the individual Counter Enable bits are used to control the PWMs.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TC</name>
					<description>Timer Counter. The 32 bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TC</name>
							<description>Timer counter value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PR</name>
					<description>Prescale Register. Determines how often the PWM counter is incremented.</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PM</name>
							<description>Prescale counter maximum value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PC</name>
					<description>Prescale Counter. Prescaler for the main PWM counter.</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PC</name>
							<description>Prescale counter value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MCR</name>
					<description>Match Control Register. The MCR is used to control whether an interrupt is generated and if the PWM counter is reset when a Match occurs.</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PWMMR0I</name>
							<description>Interrupt PWM0</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ON_PWMMR0</name>
									<description>Interrupt on PWMMR0: an interrupt is generated when PWMMR0 matches the value in the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR0R</name>
							<description>Reset PWM0</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_ON_PWMMR0_THE</name>
									<description>Reset on PWMMR0: the PWMTC will be reset if PWMMR0 matches it.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR0S</name>
							<description>Stop PWM0</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP_ON_PWMMR0_THE_</name>
									<description>Stop on PWMMR0: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR0 matches the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR1I</name>
							<description>Interrupt PWM1</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ON_PWMMR1</name>
									<description>Interrupt on PWMMR1: an interrupt is generated when PWMMR1 matches the value in the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR1R</name>
							<description>Reset PWM1</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_ON_PWMMR1_THE</name>
									<description>Reset on PWMMR1: the PWMTC will be reset if PWMMR1 matches it.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR1S</name>
							<description>Stop PWM1</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP_ON_PWMMR1_THE_</name>
									<description>Stop on PWMMR1: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR1 matches the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR2I</name>
							<description>Interrupt PWM0</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ON_PWMMR2</name>
									<description>Interrupt on PWMMR2: an interrupt is generated when PWMMR2 matches the value in the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR2R</name>
							<description>Reset PWM0</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_ON_PWMMR2_THE</name>
									<description>Reset on PWMMR2: the PWMTC will be reset if PWMMR2 matches it.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR2S</name>
							<description>Stop PWM0</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP_ON_PWMMR2_THE_</name>
									<description>Stop on PWMMR2: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR0 matches the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR3I</name>
							<description>Interrupt PWM3</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ON_PWMMR3</name>
									<description>Interrupt on PWMMR3: an interrupt is generated when PWMMR3 matches the value in the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR3R</name>
							<description>Reset PWM3</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_ON_PWMMR3_THE</name>
									<description>Reset on PWMMR3: the PWMTC will be reset if PWMMR3 matches it.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR3S</name>
							<description>Stop PWM0</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP_ON_PWMMR3_THE_</name>
									<description>Stop on PWMMR3: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR0 matches the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR4I</name>
							<description>Interrupt PWM4</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ON_PWMMR4</name>
									<description>Interrupt on PWMMR4: an interrupt is generated when PWMMR4 matches the value in the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR4R</name>
							<description>Reset PWM4</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_ON_PWMMR4_THE</name>
									<description>Reset on PWMMR4: the PWMTC will be reset if PWMMR4 matches it.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR4S</name>
							<description>Stop PWM4</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP_ON_PWMMR4_THE_</name>
									<description>Stop on PWMMR4: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR4 matches the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR5I</name>
							<description>Interrupt PWM5</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ON_PWMMR5</name>
									<description>Interrupt on PWMMR5: an interrupt is generated when PWMMR5 matches the value in the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR5R</name>
							<description>Reset PWM5</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_ON_PWMMR5_THE</name>
									<description>Reset on PWMMR5: the PWMTC will be reset if PWMMR5 matches it.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR5S</name>
							<description>Stop PWM5</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP_ON_PWMMR5_THE_</name>
									<description>Stop on PWMMR5: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR5 matches the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR6I</name>
							<description>Interrupt PWM6</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ON_PWMMR6</name>
									<description>Interrupt on PWMMR6: an interrupt is generated when PWMMR6 matches the value in the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR6R</name>
							<description>Reset PWM6</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_ON_PWMMR6_THE</name>
									<description>Reset on PWMMR6: the PWMTC will be reset if PWMMR6 matches it.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMR6S</name>
							<description>Stop PWM6</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP_ON_PWMMR6_THE_</name>
									<description>Stop on PWMMR6: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR6 matches the PWMTC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>MR%s</name>
					<description>Match Register. Match registers are continuously compared to the PWM counter in order to control PWM output edges.</description>
					<addressOffset>0x018</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATCH</name>
							<description>Timer counter match value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
