itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>CCR</name>
					<description>Capture Control Register. The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated for a capture event.</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP0_R</name>
							<description>Capture on PWMn_CAP0 rising edge</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_THIS_FEATU</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE_A_SYNCH</name>
									<description>Rising edge. A synchronously sampled rising edge on PWMn_CAP0 will cause CR0 to be loaded with the contents of the TC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP0_F</name>
							<description>Capture on PWMn_CAP0 falling edge</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_THIS_FEATU</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING_EDGE_A_SYNC</name>
									<description>Falling edge. A synchronously sampled falling edge on PWMn_CAP0 will cause CR0 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP0_I</name>
							<description>Interrupt on PWMn_CAP0 event</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_THIS_FEATU</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_A_CR0_LOA</name>
									<description>Interrupt. A CR0 load due to a PWMn_CAP0 event will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1_R</name>
							<description>Capture on PWMn_CAP1 rising edge. Reserved for PWM0.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_THIS_FEATU</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE_A_SYNCH</name>
									<description>Rising edge. A synchronously sampled rising edge on PWMn_CAP1 will cause CR1 to be loaded with the contents of the TC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1_F</name>
							<description>Capture on PWMn_CAP1 falling edge. Reserved for PWM0.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_THIS_FEATU</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING_EDGE_A_SYNC</name>
									<description>Falling edge. A synchronously sampled falling edge on PWMn_CAP1 will cause CR1 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1_I</name>
							<description>Interrupt on PWMn_CAP1 event. Reserved for PWM0.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_THIS_FEATU</name>
									<description>Disabled. This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_A_CR1_LOA</name>
									<description>Interrupt. A CR1 load due to a PWMn_CAP1 event will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>CR[%s]</name>
					<displayName>CR[%s]</displayName>
					<description>PWM Control Register. Enables PWM outputs and selects either single edge or double edge controlled PWM outputs.</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PWMSEL2</name>
							<description>PWM[2] output single/double edge mode control.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_EDGE_CONTROLL</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE_CONTROLL</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL3</name>
							<description>PWM[3] output edge control.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_EDGE_CONTROLL</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE_CONTROLL</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL4</name>
							<description>PWM[4] output edge control.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_EDGE_CONTROLL</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE_CONTROLL</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL5</name>
							<description>PWM[5] output edge control.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_EDGE_CONTROLL</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE_CONTROLL</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL6</name>
							<description>PWM[6] output edge control.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_EDGE_CONTROLL</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE_CONTROLL</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>PWMENA1</name>
							<description>PWM[1] output enable control.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA2</name>
							<description>PWM[2] output enable control.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA3</name>
							<description>PWM[3] output enable control.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA4</name>
							<description>PWM[4] output enable control.</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA5</name>
							<description>PWM[5] output enable control.</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA6</name>
							<description>PWM[6] output enable control. See PWMENA1 for details.</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Unused, always zero.</description>
							<bitRange>[31:15]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>4-6</dimIndex>
					<name>MR%s</name>
					<description>Match Register. Match registers are continuously compared to the PWM counter in order to control PWM output edges.</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATCH</name>
							<description>Timer counter match value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PCR</name>
					<description>PWM Control Register. Enables PWM outputs and selects either single edge or double edge controlled PWM outputs.</description>
					<addressOffset>0x04C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PWMSEL2</name>
							<description>PWM[2] output single/double edge mode control.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_EDGE_CONTROLL</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE_CONTROLL</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL3</name>
							<description>PWM[3] output edge control.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_EDGE_CONTROLL</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE_CONTROLL</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL4</name>
							<description>PWM[4] output edge control.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_EDGE_CONTROLL</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE_CONTROLL</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL5</name>
							<description>PWM[5] output edge control.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_EDGE_CONTROLL</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE_CONTROLL</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMSEL6</name>
							<description>PWM[6] output edge control.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_EDGE_CONTROLL</name>
									<description>Single edge controlled mode is selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE_EDGE_CONTROLL</name>
									<description>Double edge controlled mode is selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[8:7]</bitRange>
						</field>
						<field>
							<name>PWMENA1</name>
							<description>PWM[1] output enable control.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA2</name>
							<description>PWM[2] output enable control.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA3</name>
							<description>PWM[3] output enable control.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA4</name>
							<description>PWM[4] output enable control.</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA5</name>
							<description>PWM[5] output enable control.</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMENA6</name>
							<description>PWM[6] output enable control. See PWMENA1 for details.</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_DI</name>
									<description>The PWM output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PWM_OUTPUT_IS_EN</name>
									<description>The PWM output is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Unused, always zero.</description>
							<bitRange>[31:15]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>LER</name>
					<description>Load Enable Register. Enables use of updated PWM match values.</description>
					<addressOffset>0x050</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MAT0LATCHEN</name>
							<description>Enable PWM Match 0 Latch. PWM MR0 register update control. Writing a one to this bit allows the last value written to the PWM Match Register 0 to be become effective when the timer is next reset by a PWM Match event. See Section 27.6.7.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>MAT1LATCHEN</name>
							<description>Enable PWM Match 1 Latch. PWM MR1 register update control. See bit 0 for details.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>MAT2LATCHEN</name>
							<description>Enable PWM Match 2 Latch. PWM MR2 register update control. See bit 0 for details.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>MAT3LATCHEN</name>
							<description>Enable PWM Match 3 Latch. PWM MR3 register update control. See bit 0 for details.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>MAT4LATCHEN</name>
							<description>Enable PWM Match 4 Latch. PWM MR4 register update control. See bit 0 for details.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>MAT5LATCHEN</name>
							<description>Enable PWM Match 5 Latch. PWM MR5 register update control. See bit 0 for details.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>MAT6LATCHEN</name>
							<description>Enable PWM Match 6 Latch. PWM MR6 register update control. See bit 0 for details.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:7]</bitRange>
						</field>
					</fields>
				</register>
