itzandroidtab/klib-svd/lpc1756.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SPI</name>
			<description>SPI </description>
			<groupName>SPI</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SPI</name>
				<value>13</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<description>SPI Control Register. This register controls the operation of the SPI.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>BITENABLE</name>
							<description>The SPI controller sends and receives 8 bits of data per transfer.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_SPI_CONTROLLER_S</name>
									<description>The SPI controller sends and receives the number of bits selected by bits 11:8.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPHA</name>
							<description>Clock phase control determines the relationship between the data and the clock on SPI transfers, and controls when a slave transfer is defined as starting and ending.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FIRST_EDGE</name>
									<description>Data is sampled on the first clock edge of SCK. A transfer starts and ends with activation and deactivation of the SSEL signal.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SECOND_EDGE</name>
									<description>Data is sampled on the second clock edge of the SCK. A transfer starts with the first clock edge, and ends with the last sampling edge when the SSEL signal is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPOL</name>
							<description>Clock polarity control.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SCK_IS_ACTIVE_HIGH_</name>
									<description>SCK is active high.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCK_IS_ACTIVE_LOW_</name>
									<description>SCK is active low.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTR</name>
							<description>Master mode select.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SLAVE</name>
									<description>The SPI operates in Slave mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MASTER</name>
									<description>The SPI operates in Master mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LSBF</name>
							<description>LSB First controls which direction each byte is shifted when transferred.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MSB</name>
									<description>SPI data is transferred MSB (bit 7) first.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LSB</name>
									<description>SPI data is transferred LSB (bit 0) first.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPIE</name>
							<description>Serial peripheral interrupt enable.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTBLOCK</name>
									<description>SPI interrupts are inhibited.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HWINT</name>
									<description>A hardware interrupt is generated each time the SPIF or MODF bits are activated.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BITS</name>
							<description>When bit 2 of this register is 1, this field controls the number of bits per transfer:</description>
							<bitRange>[11:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>8_BITS_PER_TRANSFER</name>
									<description>8 bits per transfer</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_BITS_PER_TRANSFER</name>
									<description>9 bits per transfer</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_BITS_PER_TRANSFER</name>
									<description>10 bits per transfer</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>11_BITS_PER_TRANSFER</name>
									<description>11 bits per transfer</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12_BITS_PER_TRANSFER</name>
									<description>12 bits per transfer</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>13_BITS_PER_TRANSFER</name>
									<description>13 bits per transfer</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>14_BITS_PER_TRANSFER</name>
									<description>14 bits per transfer</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15_BITS_PER_TRANSFER</name>
									<description>15 bits per transfer</description>
									<value>0xF</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_BITS_PER_TRANSFER</name>
									<description>16 bits per transfer</description>
									<value>0x0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<description>SPI Status Register. This register shows the status of the SPI.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>ABRT</name>
							<description>Slave abort. When 1, this bit indicates that a slave abort has occurred. This bit is cleared by reading this register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>MODF</name>
							<description>Mode fault. when 1, this bit indicates that a Mode fault error has occurred. This bit is cleared by reading this register, then writing the SPI0 control register.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>ROVR</name>
							<description>Read overrun. When 1, this bit indicates that a read overrun has occurred. This bit is cleared by reading this register.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>WCOL</name>
							<description>Write collision. When 1, this bit indicates that a write collision has occurred. This bit is cleared by reading this register, then accessing the SPI Data Register.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>SPIF</name>
							<description>SPI transfer complete flag. When 1, this bit indicates when a SPI data transfer is complete. When a master, this bit is set at the end of the last cycle of the transfer. When a slave, this bit is set on the last data sampling edge of the SCK. This bit is cleared by first reading this register, then accessing the SPI Data Register. Note: this is not the SPI interrupt flag. This flag is found in the SPINT register.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DR</name>
					<description>SPI Data Register. This bi-directional register provides the transmit and receive data for the SPI. Transmit data is provided to the SPI0 by writing to this register. Data received by the SPI0 can be read from this register.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modify</readAction>
					<fields>
						<field>
							<name>DATALOW</name>
							<description>SPI Bi-directional data port.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>DATAHIGH</name>
							<description>If bit 2 of the SPCR is 1 and bits 11:8 are other than 1000, some or all of these bits contain the additional transmit and receive bits. When less than 16 bits are selected, the more significant among these bits read as zeroes.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>SPI Clock Counter Register. This register controls the frequency of a master's SCK0.</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COUNTER</name>
							<description>SPI0 Clock counter setting.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INT</name>
					<description>SPI Interrupt Flag. This register contains the interrupt flag for the SPI interface.</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SPIF</name>
							<description>SPI interrupt flag. Set by the SPI interface to generate an interrupt. Cleared by writing a 1 to this bit. Note: this bit will be set once when SPIE = 1 and at least one of SPIF and WCOL bits is 1. However, only when the SPI Interrupt bit is set and SPI0 Interrupt is enabled in the NVIC, SPI based interrupt can be processed by interrupt handling software.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[7:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
