itzandroidtab/klib-svd/lpc1756.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>RTC</name>
			<description> Real Time Clock (RTC)  </description>
			<groupName>RTC</groupName>
			<baseAddress>0x40024000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RTC</name>
				<value>17</value>
			</interrupt>
			<registers>
				<register>
					<name>ILR</name>
					<description>Interrupt Location Register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RTCCIF</name>
							<description>When one, the Counter Increment Interrupt block generated an interrupt. Writing a one to this bit location clears the counter increment interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RTCALF</name>
							<description>When one, the alarm registers generated an interrupt. Writing a one to this bit location clears the alarm interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Clock Control Register</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLKEN</name>
							<description>Clock Enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_TIME_COUNTERS_AR</name>
									<description>The time counters are enabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_TIME_COUNTERS_AR</name>
									<description>The time counters are disabled so that they may be initialized.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTCRST</name>
							<description>CTC Reset.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RESET</name>
									<description>When one, the elements in the internal oscillator divider are reset, and remain reset until CCR[1] is changed to zero. This is the divider that generates the 1 Hz clock from the 32.768 kHz crystal. The state of the divider is not visible to software.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_EFFECT_</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Internal test mode controls. These bits must be 0 for normal RTC operation.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>CCALEN</name>
							<description>Calibration counter enable.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_CALIBRATION_COUN</name>
									<description>The calibration counter is disabled and reset to zero.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_CALIBRATION_COUN</name>
									<description>The calibration counter is enabled and counting, using the 1 Hz clock. When the calibration counter is equal to the value of the CALIBRATION register, the counter resets and repeats counting up to the value of the CALIBRATION register. See Section 30.6.4.2 and  Section 30.6.5.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CIIR</name>
					<description>Counter Increment Interrupt Register</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IMSEC</name>
							<description>When 1, an increment of the Second value generates an interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>IMMIN</name>
							<description>When 1, an increment of the Minute value generates an interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>IMHOUR</name>
							<description>When 1, an increment of the Hour value generates an interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>IMDOM</name>
							<description>When 1, an increment of the Day of Month value generates an interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>IMDOW</name>
							<description>When 1, an increment of the Day of Week value generates an interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>IMDOY</name>
							<description>When 1, an increment of the Day of Year value generates an interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>IMMON</name>
							<description>When 1, an increment of the Month value generates an interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>IMYEAR</name>
							<description>When 1, an increment of the Year value generates an interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AMR</name>
					<description>Alarm Mask Register</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>AMRSEC</name>
							<description>When 1, the Second value is not compared for the alarm.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>AMRMIN</name>
							<description>When 1, the Minutes value is not compared for the alarm.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>AMRHOUR</name>
							<description>When 1, the Hour value is not compared for the alarm.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>AMRDOM</name>
							<description>When 1, the Day of Month value is not compared for the alarm.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>AMRDOW</name>
							<description>When 1, the Day of Week value is not compared for the alarm.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>AMRDOY</name>
							<description>When 1, the Day of Year value is not compared for the alarm.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>AMRMON</name>
							<description>When 1, the Month value is not compared for the alarm.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>AMRYEAR</name>
							<description>When 1, the Year value is not compared for the alarm.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CTIME0</name>
					<description>Consolidated Time Register 0</description>
					<addressOffset>0x014</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SECONDS</name>
							<description>Seconds value in the range of 0 to 59</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>MINUTES</name>
							<description>Minutes value in the range of 0 to 59</description>
							<bitRange>[13:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[15:14]</bitRange>
						</field>
						<field>
							<name>HOURS</name>
							<description>Hours value in the range of 0 to 23</description>
							<bitRange>[20:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[23:21]</bitRange>
						</field>
						<field>
							<name>DOW</name>
							<description>Day of week value in the range of 0 to 6</description>
							<bitRange>[26:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:27]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CTIME1</name>
					<description>Consolidated Time Register 1</description>
					<addressOffset>0x018</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DOM</name>
							<description>Day of month value in the range of 1 to 28, 29, 30, or 31 (depending on the month and whether it is a leap year).</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>MONTH</name>
							<description>Month value in the range of 1 to 12.</description>
							<bitRange>[11:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[15:12]</bitRange>
						</field>
						<field>
							<name>YEAR</name>
							<description>Year value in the range of 0 to 4095.</description>
							<bitRange>[27:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CTIME2</name>
					<description>Consolidated Time Register 2</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DOY</name>
							<description>Day of year value in the range of 1 to 365 (366 for leap years).</description>
							<bitRange>[11:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SEC</name>
					<description>Seconds Counter</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SECONDS</name>
							<description>Seconds value in the range of 0 to 59</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MIN</name>
					<description>Minutes Register</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>MINUTES</name>
							<description>Minutes value in the range of 0 to 59</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>HRS</name>
					<description>Hours Register</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>HOURS</name>
							<description>Hours value in the range of 0 to 23</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DOM</name>
					<description>Day of Month Register</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DOM</name>
							<description>Day of month value in the range of 1 to 28, 29, 30, or 31 (depending on the month and whether it is a leap year).</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DOW</name>
					<description>Day of Week Register</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DOW</name>
							<description>Day of week value in the range of 0 to 6.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DOY</name>
					<description>Day of Year Register</description>
					<addressOffset>0x034</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DOY</name>
							<description>Day of year value in the range of 1 to 365 (366 for leap years).</description>
							<bitRange>[8:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MONTH</name>
					<description>Months Register</description>
					<addressOffset>0x038</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>MONTH</name>
							<description>Month value in the range of 1 to 12.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>YEAR</name>
					<description>Years Register</description>
					<addressOffset>0x03C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>YEAR</name>
							<description>Year value in the range of 0 to 4095.</description>
							<bitRange>[11:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CALIBRATION</name>
					<description>Calibration Value Register</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CALVAL</name>
							<description>If enabled, the calibration counter counts up to this value. The maximum value is 131, 072 corresponding to about 36.4 hours. Calibration is disabled if CALVAL = 0.</description>
							<bitRange>[16:0]</bitRange>
						</field>
						<field>
							<name>CALDIR</name>
							<description>Calibration direction</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BACKWARD_CALIBRATION</name>
									<description>Backward calibration. When CALVAL is equal to the calibration counter, the RTC timers will stop incrementing for 1 second.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORWARD_CALIBRATION_</name>
									<description>Forward calibration. When CALVAL is equal to the calibration counter, the RTC timers will jump by 2 seconds.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>5</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-4</dimIndex>
					<name>GPREG%s</name>
					<description>General Purpose Register 0</description>
					<addressOffset>0x044</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>GP</name>
							<description>General purpose storage.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_AUX</name>
					<description>RTC Auxiliary control register</description>
					<addressOffset>0x05C</addressOffset>
					<access>read-write</access>
					<resetValue>0x10</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RTC_OSCF</name>
							<description>RTC Oscillator Fail detect flag. Read: this bit is set if the RTC oscillator stops, and when RTC power is first turned on. An interrupt will occur when this bit is set, the RTC_OSCFEN bit in RTC_AUXEN is a 1, and the RTC interrupt is enabled in the NVIC. Write: writing a 1 to this bit clears the flag.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RTC_PDOUT</name>
							<description>When 0: the RTC_ALARM pin reflects the RTC alarm status. When 1: the RTC_ALARM pin indicates Deep Power-down mode.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC_AUXEN</name>
					<description>RTC Auxiliary Enable register</description>
					<addressOffset>0x058</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RTC_OSCFEN</name>
							<description>Oscillator Fail Detect interrupt enable. When 0: the RTC Oscillator Fail detect interrupt is disabled. When 1: the RTC Oscillator Fail detect interrupt is enabled. See Section 30.6.2.5.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ASEC</name>
					<description>Alarm value for Seconds</description>
					<addressOffset>0x060</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SECONDS</name>
							<description>Seconds value in the range of 0 to 59</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AMIN</name>
					<description>Alarm value for Minutes</description>
					<addressOffset>0x64</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>MINUTES</name>
							<description>Minutes value in the range of 0 to 59</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
