itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>AHRS</name>
					<description>Alarm value for Hours</description>
					<addressOffset>0x068</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>HOURS</name>
							<description>Hours value in the range of 0 to 23</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ADOM</name>
					<description>Alarm value for Day of Month</description>
					<addressOffset>0x06C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DOM</name>
							<description>Day of month value in the range of 1 to 28, 29, 30, or 31 (depending on the month and whether it is a leap year).</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ADOW</name>
					<description>Alarm value for Day of Week</description>
					<addressOffset>0x070</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DOW</name>
							<description>Day of week value in the range of 0 to 6.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ADOY</name>
					<description>Alarm value for Day of Year</description>
					<addressOffset>0x074</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DOY</name>
							<description>Day of year value in the range of 1 to 365 (366 for leap years).</description>
							<bitRange>[8:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AMON</name>
					<description>Alarm value for Months</description>
					<addressOffset>0x078</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>MONTH</name>
							<description>Month value in the range of 1 to 12.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AYRS</name>
					<description>Alarm value for Year</description>
					<addressOffset>0x07C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>YEAR</name>
							<description>Year value in the range of 0 to 4095.</description>
							<bitRange>[11:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>GPIOINT</name>
			<description>GPIO</description>
			<groupName>GPIOINT</groupName>
			<!-- change this to base address 0x40028080 to be backwards compatible  WHY???? -->
			<baseAddress>0x40028080</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>STATUS</name>
					<description>GPIO overall Interrupt Status.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P0INT</name>
							<description>Port 0 GPIO interrupt pending.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_PENDING_INTERRUPT</name>
									<description>No pending interrupts on Port 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AT_LEAST_ONE_PENDING</name>
									<description>At least one pending interrupt on Port 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>P2INT</name>
							<description>Port 2 GPIO interrupt pending.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_PENDING_INTERRUPT</name>
									<description>No pending interrupts on Port 2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AT_LEAST_ONE_PENDING</name>
									<description>At least one pending interrupt on Port 2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STATR0</name>
					<description>GPIO Interrupt Status for Rising edge for Port 0.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P0_0REI</name>
							<description>Status of Rising Edge Interrupt for P0[0]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>P0_1REI</name>
							<description>Status of Rising Edge Interrupt for P0[1]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>P0_2REI</name>
							<description>Status of Rising Edge Interrupt for P0[2]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>P0_3REI</name>
							<description>Status of Rising Edge Interrupt for P0[3]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>P0_4REI</name>
							<description>Status of Rising Edge Interrupt for P0[4]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>P0_5REI</name>
							<description>Status of Rising Edge Interrupt for P0[5]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>P0_6REI</name>
							<description>Status of Rising Edge Interrupt for P0[6]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>P0_7REI</name>
							<description>Status of Rising Edge Interrupt for P0[7]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>P0_8REI</name>
							<description>Status of Rising Edge Interrupt for P0[8]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>P0_9REI</name>
							<description>Status of Rising Edge Interrupt for P0[9]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>P0_10REI</name>
							<description>Status of Rising Edge Interrupt for P0[10]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>P0_11REI</name>
							<description>Status of Rising Edge Interrupt for P0[11]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>P0_12REI</name>
							<description>Status of Rising Edge Interrupt for P0[12]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>P0_13REI</name>
							<description>Status of Rising Edge Interrupt for P0[13]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>P0_14REI</name>
							<description>Status of Rising Edge Interrupt for P0[14]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>P0_15REI</name>
							<description>Status of Rising Edge Interrupt for P0[15]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>P0_16REI</name>
							<description>Status of Rising Edge Interrupt for P0[16]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>P0_17REI</name>
							<description>Status of Rising Edge Interrupt for P0[17]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>P0_18REI</name>
							<description>Status of Rising Edge Interrupt for P0[18]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>P0_19REI</name>
							<description>Status of Rising Edge Interrupt for P0[19]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>P0_20REI</name>
							<description>Status of Rising Edge Interrupt for P0[20]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>P0_21REI</name>
							<description>Status of Rising Edge Interrupt for P0[21]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>P0_22REI</name>
							<description>Status of Rising Edge Interrupt for P0[22]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>P0_23REI</name>
							<description>Status of Rising Edge Interrupt for P0[23]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>P0_24REI</name>
							<description>Status of Rising Edge Interrupt for P0[24]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>P0_25REI</name>
							<description>Status of Rising Edge Interrupt for P0[25]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>P0_26REI</name>
							<description>Status of Rising Edge Interrupt for P0[26]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>P0_27REI</name>
							<description>Status of Rising Edge Interrupt for P0[27]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>P0_28REI</name>
							<description>Status of Rising Edge Interrupt for P0[28]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>P0_29REI</name>
							<description>Status of Rising Edge Interrupt for P0[29]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>P0_30REI</name>
							<description>Status of Rising Edge Interrupt for P0[30]. 0 = No rising edge detected. 1 = Rising edge interrupt generated.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STATF0</name>
					<description>GPIO Interrupt Status for Falling edge for Port 0.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P0_0FEI</name>
							<description>Status of Falling Edge Interrupt for P0[0]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>P0_1FEI</name>
							<description>Status of Falling Edge Interrupt for P0[1]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>P0_2FEI</name>
							<description>Status of Falling Edge Interrupt for P0[2]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>P0_3FEI</name>
							<description>Status of Falling Edge Interrupt for P0[3]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>P0_4FEI</name>
							<description>Status of Falling Edge Interrupt for P0[4]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>P0_5FEI</name>
							<description>Status of Falling Edge Interrupt for P0[5]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>P0_6FEI</name>
							<description>Status of Falling Edge Interrupt for P0[6]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>P0_7FEI</name>
							<description>Status of Falling Edge Interrupt for P0[7]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>P0_8FEI</name>
							<description>Status of Falling Edge Interrupt for P0[8]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>P0_9FEI</name>
							<description>Status of Falling Edge Interrupt for P0[9]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>P0_10FEI</name>
							<description>Status of Falling Edge Interrupt for P0[10]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>P0_11FEI</name>
							<description>Status of Falling Edge Interrupt for P0[11]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>P0_12FEI</name>
							<description>Status of Falling Edge Interrupt for P0[12]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>P0_13FEI</name>
							<description>Status of Falling Edge Interrupt for P0[13]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>P0_14FEI</name>
							<description>Status of Falling Edge Interrupt for P0[14]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>P0_15FEI</name>
							<description>Status of Falling Edge Interrupt for P0[15]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>P0_16FEI</name>
							<description>Status of Falling Edge Interrupt for P0[16]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>P0_17FEI</name>
							<description>Status of Falling Edge Interrupt for P0[17]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>P0_18FEI</name>
							<description>Status of Falling Edge Interrupt for P0[18]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>P0_19FEI</name>
							<description>Status of Falling Edge Interrupt for P0[19]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>P0_20FEI</name>
							<description>Status of Falling Edge Interrupt for P0[20]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>P0_21FEI</name>
							<description>Status of Falling Edge Interrupt for P0[21]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>P0_22FEI</name>
							<description>Status of Falling Edge Interrupt for P0[22]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>P0_23FEI</name>
							<description>Status of Falling Edge Interrupt for P0[23]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>P0_24FEI</name>
							<description>Status of Falling Edge Interrupt for P0[24]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>P0_25FEI</name>
							<description>Status of Falling Edge Interrupt for P0[25]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>P0_26FEI</name>
							<description>Status of Falling Edge Interrupt for P0[26]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>P0_27FEI</name>
							<description>Status of Falling Edge Interrupt for P0[27]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>P0_28FEI</name>
							<description>Status of Falling Edge Interrupt for P0[28]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>P0_29FEI</name>
							<description>Status of Falling Edge Interrupt for P0[29]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>P0_30FEI</name>
							<description>Status of Falling Edge Interrupt for P0[30]. 0 = No falling edge detected. 1 = Falling edge interrupt generated.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
