itzandroidtab/klib-svd/lpc1756.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PINCONNECT</name>
			<description>Pin connect block</description>
			<baseAddress>0x4002C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PINSEL0</name>
					<description>Pin function select register 0.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P0_0</name>
							<description>Pin function select P0.0.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RD1</name>
									<description>RD1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXD3</name>
									<description>TXD3</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SDA1</name>
									<description>SDA1</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_1</name>
							<description>Pin function select P0.1.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.1</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TD1</name>
									<description>TD1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXD3</name>
									<description>RXD3</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCL1</name>
									<description>SCL1</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_2</name>
							<description>Pin function select P0.2.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.2</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXD0</name>
									<description>TXD0</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AD0</name>
									<description>AD0.7</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_3</name>
							<description>Pin function select P0.3.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.3.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXD0</name>
									<description>RXD0</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AD0</name>
									<description>AD0.6</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_4</name>
							<description>Pin function select P0.4.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.4.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2SRX_CLK</name>
									<description>I2SRX_CLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RD2</name>
									<description>RD2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAP2</name>
									<description>CAP2.0</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_5</name>
							<description>Pin function select P0.5.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.5.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2SRX_WS</name>
									<description>I2SRX_WS</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TD2</name>
									<description>TD2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAP2</name>
									<description>CAP2.1</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_6</name>
							<description>Pin function select P0.6.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.6.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2SRX_SDA</name>
									<description>I2SRX_SDA</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSEL1</name>
									<description>SSEL1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT2</name>
									<description>MAT2.0</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_7</name>
							<description>Pin function select P0.7.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.7.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2STX_CLK</name>
									<description>I2STX_CLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCK1</name>
									<description>SCK1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT2</name>
									<description>MAT2.1</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_8</name>
							<description>Pin function select P0.8.</description>
							<bitRange>[17:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.8.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2STX_WS</name>
									<description>I2STX_WS</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MISO1</name>
									<description>MISO1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT2</name>
									<description>MAT2.2</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_9</name>
							<description>Pin function select P0.9.</description>
							<bitRange>[19:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.9</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2STX_SDA</name>
									<description>I2STX_SDA</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MOSI1</name>
									<description>MOSI1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT2</name>
									<description>MAT2.3</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_10</name>
							<description>Pin function select P0.10.</description>
							<bitRange>[21:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.10</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXD2</name>
									<description>TXD2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SDA2</name>
									<description>SDA2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT3</name>
									<description>MAT3.0</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_11</name>
							<description>Pin function select P0.11.</description>
							<bitRange>[23:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.11</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXD2</name>
									<description>RXD2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCL2</name>
									<description>SCL2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT3</name>
									<description>MAT3.1</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[29:24]</bitRange>
						</field>
						<field>
							<name>P0_15</name>
							<description>Pin function select P0.15.</description>
							<bitRange>[31:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P0</name>
									<description>GPIO P0.15</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXD1</name>
									<description>TXD1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCK0</name>
									<description>SCK0</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCK</name>
									<description>SCK</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
