itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>PINSEL3</name>
					<description>Pin function select register 3.</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P1_16</name>
							<description>Pin function select P1.16.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.16</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_MDC</name>
									<description>ENET_MDC</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_17</name>
							<description>Pin function select P1.17.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.17</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_MDIO</name>
									<description>ENET_MDIO</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_18</name>
							<description>Pin function select P1.18.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.18</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_UP_LED</name>
									<description>USB_UP_LED</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAP1</name>
									<description>CAP1.0</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_19</name>
							<description>Pin function select P1.19.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.19.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOA0</name>
									<description>MCOA0</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_PPWR</name>
									<description>USB_PPWR</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAP1</name>
									<description>CAP1.1</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_20</name>
							<description>Pin function select P1.20.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.20.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCI0</name>
									<description>MCI0</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCK0</name>
									<description>SCK0</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_21</name>
							<description>Pin function select P1.21.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.21.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCABORT</name>
									<description>MCABORT</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.3</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSEL0</name>
									<description>SSEL0</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_22</name>
							<description>Pin function select P1.22</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.22.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOB0</name>
									<description>MCOB0</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_PWRD</name>
									<description>USB_PWRD</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT1</name>
									<description>MAT1.0</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_23</name>
							<description>Pin function select P1.23.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.23.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCI1</name>
									<description>MCI1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.4</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MISO0</name>
									<description>MISO0</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_24</name>
							<description>Pin function select P1.24.</description>
							<bitRange>[17:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.24.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCI2</name>
									<description>MCI2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.5</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MOSI0</name>
									<description>MOSI0</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_25</name>
							<description>Pin function select P1.25.</description>
							<bitRange>[19:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.25</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOA1</name>
									<description>MCOA1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT1</name>
									<description>MAT1.1</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_26</name>
							<description>Pin function select P1.26.</description>
							<bitRange>[21:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.26</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOB1</name>
									<description>MCOB1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.6</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAP0</name>
									<description>CAP0.0</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_27</name>
							<description>Pin function select P1.27.</description>
							<bitRange>[23:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.27</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLKOUT</name>
									<description>CLKOUT</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_OVRCR</name>
									<description>USB_OVRCR</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAP0</name>
									<description>CAP0.1</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_28</name>
							<description>Pin function select P1.28.</description>
							<bitRange>[25:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.28</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOA2</name>
									<description>MCOA2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PCAP1</name>
									<description>PCAP1.0</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT0</name>
									<description>MAT0.0</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_29</name>
							<description>Pin function select P1.29</description>
							<bitRange>[27:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.29</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOB2</name>
									<description>MCOB2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PCAP1</name>
									<description>PCAP1.1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT0</name>
									<description>MAT0.1</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_30</name>
							<description>Pin function select P1.30.</description>
							<bitRange>[29:28]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P1</name>
									<description>GPIO P1.30</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VBUS</name>
									<description>VBUS</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AD0</name>
									<description>AD0.4</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_31</name>
							<description>Pin function select P1.31.</description>
							<bitRange>[31:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_PORT_1</name>
									<description>GPIO Port 1.31</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCK1</name>
									<description>SCK1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AD0</name>
									<description>AD0.5</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
