itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>PINSEL4</name>
					<description>Pin function select register 4</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P2_0</name>
							<description>Pin function select P2.0.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXD1</name>
									<description>TXD1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_1</name>
							<description>Pin function select P2.1.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.1</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXD1</name>
									<description>RXD1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_2</name>
							<description>Pin function select P2.2.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.2</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.3</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTS1</name>
									<description>CTS1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_3</name>
							<description>Pin function select P2.3.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.3.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DCD1</name>
									<description>DCD1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_4</name>
							<description>Pin function select P2.4.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.4.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.5</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DSR1</name>
									<description>DSR1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_5</name>
							<description>Pin function select P2.5.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.5.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.6</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTR1</name>
									<description>DTR1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_6</name>
							<description>Pin function select P2.6.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.6.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PCAP1</name>
									<description>PCAP1.0</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RI1</name>
									<description>RI1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_7</name>
							<description>Pin function select P2.7.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.7.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RD2</name>
									<description>RD2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RTS1</name>
									<description>RTS1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_8</name>
							<description>Pin function select P2.8.</description>
							<bitRange>[17:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.8.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TD2</name>
									<description>TD2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXD2</name>
									<description>TXD2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_MDC</name>
									<description>ENET_MDC</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_9</name>
							<description>Pin function select P2.9.</description>
							<bitRange>[19:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.9</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_CONNECT</name>
									<description>USB_CONNECT</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXD2</name>
									<description>RXD2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_MDIO</name>
									<description>ENET_MDIO</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_10</name>
							<description>Pin function select P2.10.</description>
							<bitRange>[21:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.10</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EINT0</name>
									<description>EINT0</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NMI</name>
									<description>NMI</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_11</name>
							<description>Pin function select P2.11.</description>
							<bitRange>[23:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.11</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EINT1</name>
									<description>EINT1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2STX_CLK</name>
									<description>I2STX_CLK</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_12</name>
							<description>Pin function select P2.12.</description>
							<bitRange>[25:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.12</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EINT2</name>
									<description>EINT2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2STX_WS</name>
									<description>I2STX_WS</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_13</name>
							<description>Pin function select P2.13.</description>
							<bitRange>[27:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P2</name>
									<description>GPIO P2.13</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EINT3</name>
									<description>EINT3</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2STX_SDA</name>
									<description>I2STX_SDA</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PINSEL7</name>
					<description>Pin function select register 7</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[17:0]</bitRange>
						</field>
						<field>
							<name>P3_25</name>
							<description>Pin function select P3.25.</description>
							<bitRange>[19:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P3</name>
									<description>GPIO P3.25</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT0</name>
									<description>MAT0.0</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.2</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3_26</name>
							<description>Pin function select P3.26.</description>
							<bitRange>[21:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P3</name>
									<description>GPIO P3.26</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STCLK</name>
									<description>STCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT0</name>
									<description>MAT0.1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
									<description>PWM1.3</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PINSEL9</name>
					<description>Pin function select register 9</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[23:0]</bitRange>
						</field>
						<field>
							<name>P4_28</name>
							<description>Pin function select P4.28.</description>
							<bitRange>[25:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P4</name>
									<description>GPIO P4.28</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RX_MCLK</name>
									<description>RX_MCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT2</name>
									<description>MAT2.0</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXD3</name>
									<description>TXD3</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4_29</name>
							<description>Pin function select P4.29.</description>
							<bitRange>[27:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>GPIO_P4</name>
									<description>GPIO P4.29</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TX_MCLK</name>
									<description>TX_MCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT2</name>
									<description>MAT2.1</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXD3</name>
									<description>RXD3</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PINSEL10</name>
					<description>Pin function select register 10</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Software should not write 1 to these bits.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>TPIUCTRL</name>
							<description>TPIU interface pins control.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. TPIU interface is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. TPIU interface is enabled. TPIU signals are available on the pins hosting them regardless of the PINSEL4 content.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Software should not write 1 to these bits.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
