itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>PINMODE0</name>
					<description>Pin mode select register 0</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P0_00MODE</name>
							<description>Port 0 pin 0 on-chip pull-up/down resistor control.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.0 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.0 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.0 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.0 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_01MODE</name>
							<description>Port 0 pin 1 control.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.1 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.1 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.1 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.1 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_02MODE</name>
							<description>Port 0 pin 2 control.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.2 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.2 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.2 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.2 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_03MODE</name>
							<description>Port 0 pin 3 control.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.3 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.3 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.3 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.3 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_04MODE</name>
							<description>Port 0 pin 4 control.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.4 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.4 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.4 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.4 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_05MODE</name>
							<description>Port 0 pin 5 control.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.5 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.5 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.5 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.5 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_06MODE</name>
							<description>Port 0 pin 6 control.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.6 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Repeater. P0.6 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.6 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.6 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_07MODE</name>
							<description>Port 0 pin 7 control.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.7 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.7 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.7 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.7 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_08MODE</name>
							<description>Port 0 pin 8 control.</description>
							<bitRange>[17:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.8 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.8 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.8 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.8 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_09MODE</name>
							<description>Port 0 pin 9 control.</description>
							<bitRange>[19:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.9 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.9 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.9 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.9 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_10MODE</name>
							<description>Port 0 pin 10 control.</description>
							<bitRange>[21:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.10 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.10 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.10 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.10 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_11MODE</name>
							<description>Port 0 pin 11 control.</description>
							<bitRange>[23:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.11 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.11 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.11 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.11 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[29:24]</bitRange>
						</field>
						<field>
							<name>P0_15MODE</name>
							<description>Port 0 pin 15 control.</description>
							<bitRange>[31:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.15 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.15 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.15 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.15 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
