itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>PINMODE1</name>
					<description>Pin mode select register 1</description>
					<addressOffset>0x044</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P0_16MODE</name>
							<description>Port 1 pin 16 control.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.16 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.16 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.16 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.16 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_17MODE</name>
							<description>Port 1 pin 17 control.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.17 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.17 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.17 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.17 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_18MODE</name>
							<description>Port 1 pin 18 control.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.18 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.18 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.18 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.18 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_19MODE</name>
							<description>Port 1 pin 19 control.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.19 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.19 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.19 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.19 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_20MODE</name>
							<description>Port 1 pin 20 control.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.20 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.20 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.20 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.20 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_21MODE</name>
							<description>Port 1 pin 21 control.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.21 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.21 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.21 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.21 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_22MODE</name>
							<description>Port 1 pin 22 control.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.22 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.22 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.22 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.22 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_23MODE</name>
							<description>Port 1 pin 23 control.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.23 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.23 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.23 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.23 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_24MODE</name>
							<description>Port 1 pin 24 control.</description>
							<bitRange>[17:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.24 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.24 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.24 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.24 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_25MODE</name>
							<description>Port 1 pin 25 control.</description>
							<bitRange>[19:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.25 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.25 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.25 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.25 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_26MODE</name>
							<description>Port 1 pin 26 control.</description>
							<bitRange>[21:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P0.26 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P0.26 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P0.26 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P0.26 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[29:22]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:30]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PINMODE2</name>
					<description>Pin mode select register 2</description>
					<addressOffset>0x048</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P1_00MODE</name>
							<description>Port 1 pin 0 control.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.0 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.0 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.0 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.0 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_01MODE</name>
							<description>Port 1 pin 1 control.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.1 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.1 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.1 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.1 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:4]</bitRange>
						</field>
						<field>
							<name>P1_04MODE</name>
							<description>Port 1 pin 4 control.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.4 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.4 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.4 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.4 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[15:10]</bitRange>
						</field>
						<field>
							<name>P1_08MODE</name>
							<description>Port 1 pin 8 control.</description>
							<bitRange>[17:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.8 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.8 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.8 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.8 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_09MODE</name>
							<description>Port 1 pin 9 control.</description>
							<bitRange>[19:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.9 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.9 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.9 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.9 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_10MODE</name>
							<description>Port 1 pin 10 control.</description>
							<bitRange>[21:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.10 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.10 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.10 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.10 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[27:22]</bitRange>
						</field>
						<field>
							<name>P1_14MODE</name>
							<description>Port 1 pin 14 control.</description>
							<bitRange>[29:28]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.14 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.14 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.14 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.14 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_15MODE</name>
							<description>Port 1 pin 15 control.</description>
							<bitRange>[31:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.15 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.15 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.15 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.15 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
