itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>PINMODE3</name>
					<description>Pin mode select register 3.</description>
					<addressOffset>0x04C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P1_16MODE</name>
							<description>Port 1 pin 16 control.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.16 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.16 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.16 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.16 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_17MODE</name>
							<description>Port 1 pin 17 control.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.17 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.17 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.17 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.17 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_18MODE</name>
							<description>Port 1 pin 18 control.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.18 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.18 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.18 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.18 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_19MODE</name>
							<description>Port 1 pin 19 control.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.19 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.19 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.19 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.19 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_20MODE</name>
							<description>Port 1 pin 20 control.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.20 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.20 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.20 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.20 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_21MODE</name>
							<description>Port 1 pin 21 control.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.21 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.21 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.21 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.21 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_22MODE</name>
							<description>Port 1 pin 22 control.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.22 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.22 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.22 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.22 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_23MODE</name>
							<description>Port 1 pin 23 control.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.23 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.23 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.23 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.23 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_24MODE</name>
							<description>Port 1 pin 24 control.</description>
							<bitRange>[17:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.24 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.24 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.24 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.24 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_25MODE</name>
							<description>Port 1 pin 25 control.</description>
							<bitRange>[19:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.25 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.25 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.25 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.25 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_26MODE</name>
							<description>Port 1 pin 26 control.</description>
							<bitRange>[21:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.26 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.26 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.26 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.26 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_27MODE</name>
							<description>Port 1 pin 27 control.</description>
							<bitRange>[23:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.27 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.27 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.27 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.27 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_28MODE</name>
							<description>Port 1 pin 28 control.</description>
							<bitRange>[25:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.28 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.28 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.28 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.28 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_29MODE</name>
							<description>Port 1 pin 29 control.</description>
							<bitRange>[27:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.29 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.29 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.29 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.29 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_30MODE</name>
							<description>Port 1 pin 30 control.</description>
							<bitRange>[29:28]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.30 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.30 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.30 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.30 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_31MODE</name>
							<description>Port 1 pin 31 control.</description>
							<bitRange>[31:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. P1.31 pin has a pull-up resistor enabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. P1.31 pin has repeater mode enabled.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. P1.31 pin has neither pull-up nor pull-down.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. P1.31 has a pull-down resistor enabled.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
