itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>PINMODE_OD0</name>
					<description>Open drain mode control register 0</description>
					<addressOffset>0x068</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P0_00OD</name>
							<description>Port 0 pin 0 open drain mode control. Pins may potentially be used for I2C-buses using standard port pins. If so, they should be configured for open drain mode via the related bits in PINMODE_OD0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.0 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.0 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_01OD</name>
							<description>Port 0 pin 1 open drain mode control. Pins may potentially be used for I2C-buses using standard port pins. If so, they should be configured for open drain mode via the related bits in PINMODE_OD0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.1 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.1 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_02OD</name>
							<description>Port 0 pin 2 open drain mode control</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.2 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.2 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_03OD</name>
							<description>Port 0 pin 3 open drain mode control</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.3 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.3 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_04OD</name>
							<description>Port 0 pin 4 open drain mode control</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.4 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.4 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_05OD</name>
							<description>Port 0 pin 5 open drain mode control</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.5 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.5 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_06OD</name>
							<description>Port 0 pin 6 open drain mode control</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.6 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.6 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_07OD</name>
							<description>Port 0 pin 7 open drain mode control</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.7 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.7 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_08OD</name>
							<description>Port 0 pin 8 open drain mode control</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.8 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.8 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_09OD</name>
							<description>Port 0 pin 9 open drain mode control</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.9 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.9 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_10OD</name>
							<description>Port 0 pin 10 open drain mode control. Pins may potentially be used for I2C-buses using standard port pins. If so, they should be configured for open drain mode via the related bits in PINMODE_OD0.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.10 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.10 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_11OD</name>
							<description>Port 0 pin 11 open drain mode control. Pins may potentially be used for I2C-buses using standard port pins. If so, they should be configured for open drain mode via the related bits in PINMODE_OD0.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.11 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.11 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[14:12]</bitRange>
						</field>
						<field>
							<name>P0_15OD</name>
							<description>Port 0 pin 15 open drain mode control</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.15 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.15 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_16OD</name>
							<description>Port 0 pin 16 open drain mode control</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.16 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.16 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_17OD</name>
							<description>Port 0 pin 17 open drain mode control</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.17 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.17 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_18OD</name>
							<description>Port 0 pin 18 open drain mode control</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.18 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.18 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_19OD</name>
							<description>Port 0 pin 19 open drain mode control. Pins may potentially be used for I2C-buses using standard port pins. If so, they should be configured for open drain mode via the related bits in PINMODE_OD0.</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.19 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.19 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_20OD</name>
							<description>Port 0 pin 20open drain mode control. Pins may potentially be used for I2C-buses using standard port pins. If so, they should be configured for open drain mode via the related bits in PINMODE_OD0.</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.20 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.20 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_21OD</name>
							<description>Port 0 pin 21 open drain mode control</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.21 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.21 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_22OD</name>
							<description>Port 0 pin 22 open drain mode control</description>
							<bitRange>[22:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.22 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.22 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_23OD</name>
							<description>Port 0 pin 23 open drain mode control</description>
							<bitRange>[23:23]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.23 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.23 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_24OD</name>
							<description>Port 0 pin 24open drain mode control</description>
							<bitRange>[24:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.23 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.23 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_25OD</name>
							<description>Port 0 pin 25 open drain mode control</description>
							<bitRange>[25:25]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.25 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.25 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_26OD</name>
							<description>Port 0 pin 26 open drain mode control</description>
							<bitRange>[26:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.26 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.26 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[28:27]</bitRange>
						</field>
						<field>
							<name>P0_29OD</name>
							<description>Port 0 pin 29 open drain mode control</description>
							<bitRange>[29:29]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.29 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.29 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_30OD</name>
							<description>Port 0 pin 30 open drain mode control</description>
							<bitRange>[30:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P0.30 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P0.30 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
