itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>PINMODE_OD1</name>
					<description>Open drain mode control register 1</description>
					<addressOffset>0x06C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P1_00OD</name>
							<description>Port 1 pin 0 open drain mode control.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.0 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.0 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_01OD</name>
							<description>Port 1 pin 1 open drain mode control, see P1.00OD</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.1 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.1 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>P1_04OD</name>
							<description>Port 1 pin 4 open drain mode control, see P1.00OD</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.4 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.4 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>P1_08OD</name>
							<description>Port 1 pin 8 open drain mode control, see P1.00OD</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.8 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.8 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_09OD</name>
							<description>Port 1 pin 9 open drain mode control, see P1.00OD</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.9 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.9 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_10OD</name>
							<description>Port 1 pin 10 open drain mode control, see P1.00OD</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.10 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.10 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[13:11]</bitRange>
						</field>
						<field>
							<name>P1_14OD</name>
							<description>Port 1 pin 14 open drain mode control, see P1.00OD</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.14 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.14 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_15OD</name>
							<description>Port 1 pin 15 open drain mode control, see P1.00OD</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.15 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.15 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_16OD</name>
							<description>Port 1 pin 16 open drain mode control, see P1.00OD</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.16 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.16 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_17OD</name>
							<description>Port 1 pin 17 open drain mode control, see P1.00OD</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.17 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.17 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_18OD</name>
							<description>Port 1 pin 18 open drain mode control, see P1.00OD</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.18 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.18 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_19OD</name>
							<description>Port 1 pin 19 open drain mode control, see P1.00OD</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.19 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.19 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_20OD</name>
							<description>Port 1 pin 20open drain mode control, see P1.00OD</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.20 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.20 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_21OD</name>
							<description>Port 1 pin 21 open drain mode control, see P1.00OD</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.21 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.21 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_22OD</name>
							<description>Port 1 pin 22 open drain mode control, see P1.00OD</description>
							<bitRange>[22:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.22 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.22 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_23OD</name>
							<description>Port 1 pin 23 open drain mode control, see P1.00OD</description>
							<bitRange>[23:23]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.23 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.23 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_24OD</name>
							<description>Port 1 pin 24open drain mode control, see P1.00OD</description>
							<bitRange>[24:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.24 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.24 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_25OD</name>
							<description>Port 1 pin 25 open drain mode control, see P1.00OD</description>
							<bitRange>[25:25]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.25 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.25 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_26OD</name>
							<description>Port 1 pin 26 open drain mode control, see P1.00OD</description>
							<bitRange>[26:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.26 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.26 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_27OD</name>
							<description>Port 1 pin 27 open drain mode control, see P1.00OD</description>
							<bitRange>[27:27]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.27 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.27 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_28OD</name>
							<description>Port 1 pin 28 open drain mode control, see P1.00OD</description>
							<bitRange>[28:28]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.28 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.28 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_29OD</name>
							<description>Port 1 pin 29 open drain mode control, see P1.00OD</description>
							<bitRange>[29:29]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.29 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.29 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_30OD</name>
							<description>Port 1 pin 30 open drain mode control, see P1.00OD</description>
							<bitRange>[30:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.30 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.30 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_31OD</name>
							<description>Port 1 pin 31 open drain mode control.</description>
							<bitRange>[31:31]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P1.31 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P1.31 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
