itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>PINMODE_OD2</name>
					<description>Open drain mode control register 2</description>
					<addressOffset>0x070</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P2_00OD</name>
							<description>Port 2 pin 0 open drain mode control.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.0 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.0 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_01OD</name>
							<description>Port 2 pin 1 open drain mode control, see P2.00OD</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.1 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.1p in is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_02OD</name>
							<description>Port 2 pin 2 open drain mode control, see P2.00OD</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.2 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.2 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_03OD</name>
							<description>Port 2 pin 3 open drain mode control, see P2.00OD</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.3 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.3 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_04OD</name>
							<description>Port 2 pin 4 open drain mode control, see P2.00OD</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.4 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.4 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_05OD</name>
							<description>Port 2 pin 5 open drain mode control, see P2.00OD</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.5 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.5 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_06OD</name>
							<description>Port 2 pin 6 open drain mode control, see P2.00OD</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.6 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.6 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_07OD</name>
							<description>Port 2 pin 7 open drain mode control, see P2.00OD</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.7 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.7 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_08OD</name>
							<description>Port 2 pin 8 open drain mode control, see P2.00OD</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.8 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.8 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_09OD</name>
							<description>Port 2 pin 9 open drain mode control, see P2.00OD</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.9 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.9 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_10OD</name>
							<description>Port 2 pin 10 open drain mode control, see P2.00OD</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.10 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.10 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_11OD</name>
							<description>Port 2 pin 11 open drain mode control, see P2.00OD</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.11 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.11 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_12OD</name>
							<description>Port 2 pin 12 open drain mode control, see P2.00OD</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.12 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.12 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_13OD</name>
							<description>Port 2 pin 13 open drain mode control, see P2.00OD</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P2.13 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P2.13 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:14]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PINMODE_OD3</name>
					<description>Open drain mode control register 3</description>
					<addressOffset>0x074</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[24:0]</bitRange>
						</field>
						<field>
							<name>P3_25OD</name>
							<description>Port 3 pin 25 open drain mode control.</description>
							<bitRange>[25:25]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P3.25 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P3.25 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3_26OD</name>
							<description>Port 3 pin 26 open drain mode control, see P3.25OD</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:27]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PINMODE_OD4</name>
					<description>Open drain mode control register 4</description>
					<addressOffset>0x078</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[27:0]</bitRange>
						</field>
						<field>
							<name>P4_28OD</name>
							<description>Port 4 pin 28 open drain mode control.</description>
							<bitRange>[28:28]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. P4.28 pin is in the normal (not open drain) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. P4.28 pin is in the open drain mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4_29OD</name>
							<description>Port 4 pin 29 open drain mode control, see P4.28OD</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:30]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CPADCFG</name>
					<description>I2C Pin Configuration register</description>
					<addressOffset>0x07C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SDADRV0</name>
							<description>Drive mode control for the SDA0 pin, P0.27.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard. The SDA0 pin is in the standard drive mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST_MODE_PLUS</name>
									<description>Fast-mode plus. The SDA0 pin is in Fast Mode Plus drive mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SDAI2C0</name>
							<description>I 2C filter mode control for the SDA0 pin, P0.27.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The SDA0 pin has I2C glitch filtering and slew rate control enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The SDA0 pin has I2C glitch filtering and slew rate control disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCLDRV0</name>
							<description>Drive mode control for the SCL0 pin, P0.28.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard. The SCL0 pin is in the standard drive mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST_MODE_PLUS</name>
									<description>Fast-mode plus. The SCL0 pin is in Fast Mode Plus drive mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCLI2C0</name>
							<description>I 2C filter mode control for the SCL0 pin, P0.28.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The SCL0 pin has I2C glitch filtering and slew rate control enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The SCL0 pin has I2C glitch filtering and slew rate control disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
