itzandroidtab/klib-svd/lpc1756.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADC</name>
			<description>Analog-to-Digital Converter (ADC) </description>
			<groupName>ADC</groupName>
			<baseAddress>0x40034000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC</name>
				<value>22</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<description>A/D Control Register. The ADCR register must be written to select the operating mode before A/D conversion can occur.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>Selects which of the AD0[7:0] pins is (are) to be sampled and converted. For AD0, bit 0 selects Pin AD0[0], and bit 7 selects pin AD0[7]. In software-controlled mode, only one of these bits should be 1. In hardware scan mode, any value containing 1 to 8 ones is allowed. All zeroes is equivalent to 0x01.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>CLKDIV</name>
							<description>The APB clock (PCLK) is divided by (this value plus one) to produce the clock for the A/D converter, which should be less than or equal to 12.4 MHz. Typically, software should program the smallest value in this field that yields a clock of 12.4 MHz or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>BURST</name>
							<description>Burst mode</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BURST</name>
									<description>The AD converter does repeated conversions at up to 400 kHz, scanning (if necessary) through the pins selected by bits set to ones in the SEL field. The first conversion after the start corresponds to the least-significant 1 in the SEL field, then higher numbered 1-bits (pins) if applicable. Repeated conversions can be terminated by clearing this bit, but the conversion that's in progress when this bit is cleared will be completed. START bits must be 000 when BURST = 1 or conversions will not start.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SW</name>
									<description>Conversions are software controlled and require 31 clocks.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[20:17]</bitRange>
						</field>
						<field>
							<name>PDN</name>
							<description>Power down mode</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>POWERED</name>
									<description>The A/D converter is operational.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERDOWN</name>
									<description>The A/D converter is in power-down mode.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[23:22]</bitRange>
						</field>
						<field>
							<name>START</name>
							<description>When the BURST bit is 0, these bits control whether and when an A/D conversion is started:</description>
							<bitRange>[26:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_START_THIS_VALUE</name>
									<description>No start (this value should be used when clearing PDN to 0).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START_CONVERSION_NOW</name>
									<description>Start conversion now.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P2_10</name>
									<description>Start conversion when the edge selected by bit 27 occurs on the P2[10] pin.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P1_27</name>
									<description>Start conversion when the edge selected by bit 27 occurs on the P1[27] pin.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT0_1</name>
									<description>Start conversion when the edge selected by bit 27 occurs on MAT0.1. Note that this does not require that the MAT0.1 function appear on a device pin.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT0_3</name>
									<description>Start conversion when the edge selected by bit 27 occurs on MAT0.3. Note that it is not possible to cause the MAT0.3 function to appear on a device pin.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT1_0</name>
									<description>Start conversion when the edge selected by bit 27 occurs on MAT1.0. Note that this does not require that the MAT1.0 function appear on a device pin.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAT1_1</name>
									<description>Start conversion when the edge selected by bit 27 occurs on MAT1.1. Note that this does not require that the MAT1.1 function appear on a device pin.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>This bit is significant only when the START field contains 010-111. In these cases:</description>
							<bitRange>[27:27]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FALLLING</name>
									<description>Start conversion on a falling edge on the selected CAP/MAT signal.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>Start conversion on a rising edge on the selected CAP/MAT signal.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>GDR</name>
					<description>A/D Global Data Register. This register contains the ADC's DONE bit and the result of the most recent A/D conversion.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESULT</name>
							<description>When DONE is 1, this field contains a binary fraction representing the voltage on the AD0[n] pin selected by the SEL field, as it falls within the range of VREFP to VSS. Zero in the field indicates that the voltage on the input pin was less than, equal to, or close to that on VSS, while 0xFFF indicates that the voltage on the input was close to, equal to, or greater than that on VREFP.</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>CHN</name>
							<description>These bits contain the channel from which the RESULT bits were converted (e.g. 000 identifies channel 0, 001 channel 1...).</description>
							<bitRange>[26:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[29:27]</bitRange>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the RESULT bits. This bit is cleared by reading this register.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DONE</name>
							<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read and when the ADCR is written. If the ADCR is written while a conversion is still in progress, this bit is set and a new conversion is started.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN</name>
					<description>A/D Interrupt Enable Register. This register contains enable bits that allow the DONE flag of each A/D channel to be included or excluded from contributing to the generation of an A/D interrupt.</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0x100</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADINTEN0</name>
							<description>Interrupt enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 0 will not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 0 will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN1</name>
							<description>Interrupt enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 1 will not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 1 will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN2</name>
							<description>Interrupt enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 2 will not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 2 will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN3</name>
							<description>Interrupt enable</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 3 will not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 3 will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN4</name>
							<description>Interrupt enable</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 4 will not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 4 will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN5</name>
							<description>Interrupt enable</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 5 will not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 5 will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN6</name>
							<description>Interrupt enable</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 6 will not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 6 will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADINTEN7</name>
							<description>Interrupt enable</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Completion of a conversion on ADC channel 7 will not generate an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Completion of a conversion on ADC channel 7 will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADGINTEN</name>
							<description>Interrupt enable</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CHANNELS</name>
									<description>Only the individual ADC channels enabled by ADINTEN7:0 will generate interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GLOBAL</name>
									<description>The global DONE flag in ADDR is enabled to generate an interrupt in addition to any individual ADC channels that are enabled to generate interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>DR[%s]</name>
					<displayName>DR[%s]</displayName>
					<description>A/D Channel 0 Data Register. This register contains the result of the most recent conversion completed on channel 0.</description>
					<addressOffset>0x010</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESULT</name>
							<description>When DONE is 1, this field contains a binary fraction representing the voltage on the AD0[n] pin, as it falls within the range of VREFP to V SS. Zero in the field indicates that the voltage on the input pin was less than, equal to, or close to that on VSS, while 0xFFF indicates that the voltage on the input was close to, equal to, or greater than that on VREFP.</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[29:16]</bitRange>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the RESULT bits.This bit is cleared by reading this register.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DONE</name>
							<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>A/D Status Register. This register contains DONE and OVERRUN flags for all of the A/D channels, as well as the A/D interrupt/DMA flag.</description>
					<addressOffset>0x030</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DONE0</name>
							<description>This bit mirrors the DONE status flag from the result register for A/D channel 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DONE1</name>
							<description>This bit mirrors the DONE status flag from the result register for A/D channel 1.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>DONE2</name>
							<description>This bit mirrors the DONE status flag from the result register for A/D channel 2.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DONE3</name>
							<description>This bit mirrors the DONE status flag from the result register for A/D channel 3.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DONE4</name>
							<description>This bit mirrors the DONE status flag from the result register for A/D channel 4.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>DONE5</name>
							<description>This bit mirrors the DONE status flag from the result register for A/D channel 5.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>DONE6</name>
							<description>This bit mirrors the DONE status flag from the result register for A/D channel 6.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>DONE7</name>
							<description>This bit mirrors the DONE status flag from the result register for A/D channel 7.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>OVERRUN0</name>
							<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 0.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>OVERRUN1</name>
							<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 1.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>OVERRUN2</name>
							<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 2.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>OVERRUN3</name>
							<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 3.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>OVERRUN4</name>
							<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 4.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>OVERRUN5</name>
							<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 5.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>OVERRUN6</name>
							<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 6.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>OVERRUN7</name>
							<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 7.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>ADINT</name>
							<description>This bit is the A/D interrupt flag. It is one when any of the individual A/D channel Done flags is asserted and enabled to contribute to the A/D interrupt via the ADINTEN register.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:17]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TRM</name>
					<description>ADC trim register.</description>
					<addressOffset>0x034</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>ADCOFFS</name>
							<description>Offset trim bits for ADC operation. Initialized by the boot code. Can be overwritten by the user.</description>
							<bitRange>[7:4]</bitRange>
						</field>
						<field>
							<name>TRIM</name>
							<description>written-to by boot code. Can not be overwritten by the user. These bits are locked after boot code write.</description>
							<bitRange>[11:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
