itzandroidtab/klib-svd/lpc1756.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CAN1</name>
			<description>CAN1 controller </description>
			<groupName>CAN</groupName>
			<baseAddress>0x40044000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CAN</name>
				<value>25</value>
			</interrupt>
			<registers>
				<register>
					<name>MOD</name>
					<description>Controls the operating mode of the CAN Controller.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RM</name>
							<description>Reset Mode.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL_THE_CAN_CONTR</name>
									<description>Normal.The CAN Controller is in the Operating Mode, and certain registers can not be written.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_CAN_OPERATION</name>
									<description>Reset. CAN operation is disabled, writable registers can be written and the current transmission/reception of a message is aborted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOM</name>
							<description>Listen Only Mode.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL_THE_CAN_CONT</name>
									<description>Normal. The CAN controller acknowledges a successfully received message on the CAN bus. The error counters are stopped at the current value.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LISTEN_ONLY_THE_CON</name>
									<description>Listen only. The controller gives no acknowledgment, even if a message is successfully received. Messages cannot be sent, and the controller operates in error passive mode. This mode is intended for software bit rate detection and hot plugging.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STM</name>
							<description>Self Test Mode.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL_A_TRANSMITTE</name>
									<description>Normal. A transmitted message must be acknowledged to be considered successful.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELF_TEST_THE_CONTR</name>
									<description>Self test. The controller will consider a Tx message successful even if there is no acknowledgment received. In this mode a full node test is possible without any other active node on the bus using the SRR bit in CANxCMR.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TPM</name>
							<description>Transmit Priority Mode.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CAN_ID_THE_TRANSMIT</name>
									<description>CAN ID. The transmit priority for 3 Transmit Buffers depends on the CAN Identifier.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCAL_PRIORITY_THE_</name>
									<description>Local priority. The transmit priority for 3 Transmit Buffers depends on the contents of the Tx Priority register within the Transmit Buffer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SM</name>
							<description>Sleep Mode.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>WAKE_UP_NORMAL_OPER</name>
									<description>Wake-up. Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SLEEP_THE_CAN_CONTR</name>
									<description>Sleep. The CAN controller enters Sleep Mode if no CAN interrupt is pending and there is no bus activity. See the Sleep Mode description Section 21.8.2 on page 565.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RPM</name>
							<description>Receive Polarity Mode.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW_ACTIVE_RD_INPUT</name>
									<description>Low active. RD input is active Low (dominant bit = 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_ACTIVE_RD_INPU</name>
									<description>High active. RD input is active High (dominant bit = 1) -- reverse polarity.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>TM</name>
							<description>Test Mode.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_NORMAL_OPE</name>
									<description>Disabled. Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED_THE_TD_PIN_</name>
									<description>Enabled. The TD pin will reflect the bit, detected on RD pin, with the next positive edge of the system clock.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CMR</name>
					<description>Command bits that affect the state of the CAN Controller</description>
					<addressOffset>0x004</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TR</name>
							<description>Transmission Request.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ABSENT_NO_TRANSMISSI</name>
									<description>Absent.No transmission request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRESENT_THE_MESSAGE</name>
									<description>Present. The message, previously written to the CANxTFI, CANxTID, and optionally the CANxTDA and CANxTDB registers, is queued for transmission from the selected Transmit Buffer. If at two or all three of STB1, STB2 and STB3 bits are selected when TR=1 is written, Transmit Buffer will be selected based on the chosen priority scheme (for details see Section 21.5.3 Transmit Buffers (TXB))</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AT</name>
							<description>Abort Transmission.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_ACTION_DO_NOT_AB</name>
									<description>No action. Do not abort the transmission.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRESENT_IF_NOT_ALRE</name>
									<description>Present. if not already in progress, a pending Transmission Request for the selected Transmit Buffer is cancelled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RRB</name>
							<description>Release Receive Buffer.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_ACTION_DO_NOT_RE</name>
									<description>No action. Do not release the receive buffer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RELEASED_THE_INFORM</name>
									<description>Released. The information in the Receive Buffer (consisting of CANxRFS, CANxRID, and if applicable the CANxRDA and CANxRDB registers) is released, and becomes eligible for replacement by the next received frame. If the next received frame is not available, writing this command clears the RBS bit in the Status Register(s).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDO</name>
							<description>Clear Data Overrun.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_ACTION_DO_NOT_CL</name>
									<description>No action. Do not clear the data overrun bit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_THE_DATA_OVER</name>
									<description>Clear. The Data Overrun bit in Status Register(s) is cleared.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRR</name>
							<description>Self Reception Request.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ABSENT_NO_SELF_RECE</name>
									<description>Absent. No self reception request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRESENT_THE_MESSAGE</name>
									<description>Present. The message, previously written to the CANxTFS, CANxTID, and optionally the CANxTDA and CANxTDB registers, is queued for transmission from the selected Transmit Buffer and received simultaneously. This differs from the TR bit above in that the receiver is not disabled during the transmission, so that it receives the message if its Identifier is recognized by the Acceptance Filter.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STB1</name>
							<description>Select Tx Buffer 1.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_SELECTED_TX_BUF</name>
									<description>Not selected. Tx Buffer 1 is not selected for transmission.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTED_TX_BUFFER_</name>
									<description>Selected. Tx Buffer 1 is selected for transmission.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STB2</name>
							<description>Select Tx Buffer 2.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_SELECTED_TX_BUF</name>
									<description>Not selected. Tx Buffer 2 is not selected for transmission.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTED_TX_BUFFER_</name>
									<description>Selected. Tx Buffer 2 is selected for transmission.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STB3</name>
							<description>Select Tx Buffer 3.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_SELECTED_TX_BUF</name>
									<description>Not selected. Tx Buffer 3 is not selected for transmission.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTED_TX_BUFFER_</name>
									<description>Selected. Tx Buffer 3 is selected for transmission.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>GSR</name>
					<description>Global Controller Status and Error Counters. The error counters can only be written when RM in CANMOD is 1.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-only</access>
					<resetValue>0x3C</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RBS</name>
							<description>Receive Buffer Status. After reading all messages and releasing their memory space with the command 'Release Receive Buffer,' this bit is cleared.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EMPTY_NO_MESSAGE_IS</name>
									<description>Empty. No message is available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL_AT_LEAST_ONE_C</name>
									<description>Full. At least one complete message is received by the Double Receive Buffer and available in the CANxRFS, CANxRID, and if applicable the CANxRDA and CANxRDB registers. This bit is cleared by the Release Receive Buffer command in CANxCMR, if no subsequent received message is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DOS</name>
							<description>Data Overrun Status. If there is not enough space to store the message within the Receive Buffer, that message is dropped and the Data Overrun condition is signalled to the CPU in the moment this message becomes valid. If this message is not completed successfully (e.g. because of an error), no overrun condition is signalled.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ABSENT_NO_DATA_OVER</name>
									<description>Absent. No data overrun has occurred since the last Clear Data Overrun command was given/written to CANxCMR (or since Reset).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN_A_MESSAGE_W</name>
									<description>Overrun. A message was lost because the preceding message to this CAN controller was not read and released quickly enough (there was not enough space for a new message in the Double Receive Buffer).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TBS</name>
							<description>Transmit Buffer Status.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOCKED_AT_LEAST_ONE</name>
									<description>Locked. At least one of the Transmit Buffers is not available for the CPU, i.e. at least one previously queued message for this CAN controller has not yet been sent, and therefore software should not write to the CANxTFI, CANxTID, CANxTDA, nor CANxTDB registers of that (those) Tx buffer(s).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RELEASED_ALL_THREE_</name>
									<description>Released. All three Transmit Buffers are available for the CPU. No transmit message is pending for this CAN controller (in any of the 3 Tx buffers), and software may write to any of the CANxTFI, CANxTID, CANxTDA, and CANxTDB registers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TCS</name>
							<description>Transmit Complete Status. The Transmission Complete Status bit is set '0' (incomplete) whenever the Transmission Request bit or the Self Reception Request bit is set '1' at least for one of the three Transmit Buffers. The Transmission Complete Status bit will remain '0' until all messages are transmitted successfully.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INCOMPLETE_AT_LEAST</name>
									<description>Incomplete. At least one requested transmission has not been successfully completed yet.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COMPLETE_ALL_REQUES</name>
									<description>Complete. All requested transmission(s) has (have) been successfully completed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RS</name>
							<description>Receive Status. If both the Receive Status and the Transmit Status bits are '0' (idle), the CAN-Bus is idle. If both bits are set, the controller is waiting to become idle again. After hardware reset 11 consecutive recessive bits have to be detected until idle status is reached. After Bus-off this will take 128 times of 11 consecutive recessive bits.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IDLE_THE_CAN_CONTRO</name>
									<description>Idle. The CAN controller is idle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RECEIVE_THE_CAN_CON</name>
									<description>Receive. The CAN controller is receiving a message.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS</name>
							<description>Transmit Status. If both the Receive Status and the Transmit Status bits are '0' (idle), the CAN-Bus is idle. If both bits are set, the controller is waiting to become idle again. After hardware reset 11 consecutive recessive bits have to be detected until idle status is reached. After Bus-off this will take 128 times of 11 consecutive recessive bits.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IDLE_THE_CAN_CONTRO</name>
									<description>Idle. The CAN controller is idle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRANSMIT_THE_CAN_CO</name>
									<description>Transmit. The CAN controller is sending a message.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ES</name>
							<description>Error Status. Errors detected during reception or transmission will effect the error counters according to the CAN specification. The Error Status bit is set when at least one of the error counters has reached or exceeded the Error Warning Limit. An Error Warning Interrupt is generated, if enabled. The default value of the Error Warning Limit after hardware reset is 96 decimal, see also Section 21.7.7 CAN Error Warning Limit register (CAN1EWL - 0x4004 4018, CAN2EWL - 0x4004 8018).</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>OK_BOTH_ERROR_COUNT</name>
									<description>OK. Both error counters are below the Error Warning Limit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ERROR_ONE_OR_BOTH_O</name>
									<description>Error. One or both of the Transmit and Receive Error Counters has reached the limit set in the Error Warning Limit register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BS</name>
							<description>Bus Status. Mode bit '1' (present) and an Error Warning Interrupt is generated, if enabled. Afterwards the Transmit Error Counter is set to '127', and the Receive Error Counter is cleared. It will stay in this mode until the CPU clears the Reset Mode bit. Once this is completed the CAN Controller will wait the minimum protocol-defined time (128 occurrences of the Bus-Free signal) counting down the Transmit Error Counter. After that, the Bus Status bit is cleared (Bus-On), the Error Status bit is set '0' (ok), the Error Counters are reset, and an Error Warning Interrupt is generated, if enabled. Reading the TX Error Counter during this time gives information about the status of the Bus-Off recovery.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BUS_ON_THE_CAN_CONT</name>
									<description>Bus-on. The CAN Controller is involved in bus activities</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BUS_OFF_THE_CAN_CON</name>
									<description>Bus-off. The CAN controller is currently not involved/prohibited from bus activity because the Transmit Error Counter reached its limiting value of 255.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>RXERR</name>
							<description>The current value of the Rx Error Counter (an 8-bit value).</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>TXERR</name>
							<description>The current value of the Tx Error Counter (an 8-bit value).</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
