itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>CP</name>
					<description>Communication Pattern register</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCPA0</name>
							<description>Communication pattern output A, channel 0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOA0_PASSIVE_</name>
									<description>MCOA0 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERNAL_MCOA0_</name>
									<description>internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPB0</name>
							<description>Communication pattern output B, channel 0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOB0_PASSIVE_</name>
									<description>MCOB0 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOB0_TRACKS_INTERNA</name>
									<description>MCOB0 tracks internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPA1</name>
							<description>Communication pattern output A, channel 1.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOA1_PASSIVE_</name>
									<description>MCOA1 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOA1_TRACKS_INTERNA</name>
									<description>MCOA1 tracks internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPB1</name>
							<description>Communication pattern output B, channel 1.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOB1_PASSIVE_</name>
									<description>MCOB1 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOB1_TRACKS_INTERNA</name>
									<description>MCOB1 tracks internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPA2</name>
							<description>Communication pattern output A, channel 2.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOA2_PASSIVE_</name>
									<description>MCOA2 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOA2_TRACKS_INTERNA</name>
									<description>MCOA2 tracks internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPB2</name>
							<description>Communication pattern output B, channel 2.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MCOB2_PASSIVE_</name>
									<description>MCOB2 passive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCOB2_TRACKS_INTERNA</name>
									<description>MCOB2 tracks internal MCOA0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-2</dimIndex>
					<name>CAP[%s]</name>
					<displayName>CAP[%s]</displayName>
					<description>Capture register</description>
					<addressOffset>0x044</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP</name>
							<description>Current TC value at a capture event.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN</name>
					<description>Interrupt Enable read address</description>
					<addressOffset>0x050</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ILIM0</name>
							<description>Limit interrupt for channel 0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_DISABLED_</name>
									<description>Interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ENABLED_</name>
									<description>Interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IMAT0</name>
							<description>Match interrupt for channel 0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_DISABLED_</name>
									<description>Interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ENABLED_</name>
									<description>Interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICAP0</name>
							<description>Capture interrupt for channel 0.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_DISABLED_</name>
									<description>Interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ENABLED_</name>
									<description>Interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ILIM1</name>
							<description>Limit interrupt for channel 1.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_DISABLED_</name>
									<description>Interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ENABLED_</name>
									<description>Interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IMAT1</name>
							<description>Match interrupt for channel 1.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_DISABLED_</name>
									<description>Interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ENABLED_</name>
									<description>Interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICAP1</name>
							<description>Capture interrupt for channel 1.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_DISABLED_</name>
									<description>Interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ENABLED_</name>
									<description>Interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>ILIM2</name>
							<description>Limit interrupt for channel 2.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_DISABLED_</name>
									<description>Interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ENABLED_</name>
									<description>Interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IMAT2</name>
							<description>Match interrupt for channel 2.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_DISABLED_</name>
									<description>Interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ENABLED_</name>
									<description>Interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICAP2</name>
							<description>Capture interrupt for channel 2.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_DISABLED_</name>
									<description>Interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ENABLED_</name>
									<description>Interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[14:11]</bitRange>
						</field>
						<field>
							<name>ABORT</name>
							<description>Fast abort interrupt.</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_DISABLED_</name>
									<description>Interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ENABLED_</name>
									<description>Interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN_SET</name>
					<description>Interrupt Enable set address</description>
					<addressOffset>0x054</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ILIM0_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>IMAT0_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ICAP0_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ILIM1_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>IMAT1_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ICAP1_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>ILIM2_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>IMAT2_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>ICAP2_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[14:12]</bitRange>
						</field>
						<field>
							<name>ABORT_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN_CLR</name>
					<description>Interrupt Enable clear address</description>
					<addressOffset>0x058</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ILIM0_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>IMAT0_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ICAP0_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ILIM1_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>IMAT1_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ICAP1_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>ILIM2_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>IMAT2_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>ICAP2_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[14:11]</bitRange>
						</field>
						<field>
							<name>ABORT_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
