itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>CCLKCFG</name>
					<description>CPU Clock Configuration Register</description>
					<addressOffset>0x104</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCLKSEL</name>
							<description>Selects the divide value for creating the CPU clock (CCLK) from the PLL0 output. 0 = pllclk is divided by 1 to produce the CPU clock. This setting is not allowed when the PLL0 is connected, because the rate would always be greater than the maximum allowed CPU clock. 1 = pllclk is divided by 2 to produce the CPU clock. This setting is not allowed when the PLL0 is connected, because the rate would always be greater than the maximum allowed CPU clock. 2 = pllclk is divided by 3 to produce the CPU clock. 3 = pllclk is divided by 4 to produce the CPU clock. ... 255 = pllclk is divided by 256 to produce the CPU clock.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>USBCLKCFG</name>
					<description>USB Clock Configuration Register</description>
					<addressOffset>0x108</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>USBSEL</name>
							<description>Selects the divide value for creating the USB clock from the PLL0 output. Only the values shown below can produce even number multiples of 48 MHz from the PLL0 output.  Warning: Improper setting of this value will result in incorrect operation of the USB interface. 5 = PLL0 output is divided by 6. PLL0 output must be 288 MHz. 7 = PLL0 output is divided by 8. PLL0 output must be 384 MHz. 9 = PLL0 output is divided by 10. PLL0 output must be 480 MHz.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKSRCSEL</name>
					<description>Clock Source Select Register</description>
					<addressOffset>0x10C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKSRC</name>
							<description>Selects the clock source for PLL0 as follows. Warning: Improper setting of this value, or an incorrect sequence of changing this value may result in incorrect operation of the device.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SELECTS_THE_INTERNAL</name>
									<description>Selects the Internal RC oscillator as the PLL0 clock source (default).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTS_THE_MAIN_OSC</name>
									<description>Selects the main oscillator as the PLL0 clock source.  Select the main oscillator as PLL0 clock source if the PLL0 clock output is used for USB or for CAN with baudrates > 100 kBit/s.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTS_THE_RTC_OSCI</name>
									<description>Selects the RTC oscillator as the PLL0 clock source.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved, do not use this setting.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CANSLEEPCLR</name>
					<description>Allows clearing the current CAN channel sleep state as well as reading that state.</description>
					<addressOffset>0x110</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CAN1SLEEP</name>
							<description>Sleep status and control for CAN channel 1. Read: when 1, indicates that CAN channel 1 is in the sleep mode. Write: writing a 1 causes clocks to be restored to CAN channel 1.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CAN2SLEEP</name>
							<description>Sleep status and control for CAN channel 2. Read: when 1, indicates that CAN channel 2 is in the sleep mode. Write: writing a 1 causes clocks to be restored to CAN channel 2.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CANWAKEFLAGS</name>
					<description>Allows reading the wake-up state of the CAN channels.</description>
					<addressOffset>0x114</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CAN1WAKE</name>
							<description>Wake-up status for CAN channel 1. Read: when 1, indicates that a falling edge has occurred on the receive data line of CAN channel 1. Write: writing a 1 clears this bit.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CAN2WAKE</name>
							<description>Wake-up status for CAN channel 2. Read: when 1, indicates that a falling edge has occurred on the receive data line of CAN channel 2. Write: writing a 1 clears this bit.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTINT</name>
					<description>External Interrupt Flag Register</description>
					<addressOffset>0x140</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EINT0</name>
							<description>In level-sensitive mode, this bit is set if the EINT0 function is selected for its pin, and the pin is in its active state. In edge-sensitive mode, this bit is set if the EINT0 function is selected for its pin, and the selected edge occurs on the pin. This bit is cleared by writing a one to it, except in level sensitive mode when the pin is in its active state.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EINT1</name>
							<description>In level-sensitive mode, this bit is set if the EINT1 function is selected for its pin, and the pin is in its active state. In edge-sensitive mode, this bit is set if the EINT1 function is selected for its pin, and the selected edge occurs on the pin. This bit is cleared by writing a one to it, except in level sensitive mode when the pin is in its active state.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EINT2</name>
							<description>In level-sensitive mode, this bit is set if the EINT2 function is selected for its pin, and the pin is in its active state. In edge-sensitive mode, this bit is set if the EINT2 function is selected for its pin, and the selected edge occurs on the pin. This bit is cleared by writing a one to it, except in level sensitive mode when the pin is in its active state.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EINT3</name>
							<description>In level-sensitive mode, this bit is set if the EINT3 function is selected for its pin, and the pin is in its active state. In edge-sensitive mode, this bit is set if the EINT3 function is selected for its pin, and the selected edge occurs on the pin. This bit is cleared by writing a one to it, except in level sensitive mode when the pin is in its active state.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTMODE</name>
					<description>External Interrupt Mode register</description>
					<addressOffset>0x148</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EXTMODE0</name>
							<description>External interrupt 0 EINT0 mode.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_SENSITIVE</name>
									<description>Level-sensitive. Level-sensitivity is selected for EINT0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_SENSITIVE</name>
									<description>Edge-sensitive. EINT0 is edge sensitive.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTMODE1</name>
							<description>External interrupt 1 EINT1 mode.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_SENSITIVE</name>
									<description>Level-sensitive. Level-sensitivity is selected for EINT1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_SENSITIVE</name>
									<description>Edge-sensitive. EINT1 is edge sensitive.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTMODE2</name>
							<description>External interrupt 2 EINT2 mode.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_SENSITIVE</name>
									<description>Level-sensitive. Level-sensitivity is selected for EINT2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_SENSITIVE</name>
									<description>Edge-sensitive. EINT2 is edge sensitive.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTMODE3</name>
							<description>External interrupt 3 EINT3 mode.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_SENSITIVE</name>
									<description>Level-sensitive. Level-sensitivity is selected for EINT3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE_SENSITIVE</name>
									<description>Edge-sensitive. EINT3 is edge sensitive.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTPOLAR</name>
					<description>External Interrupt Polarity Register</description>
					<addressOffset>0x14C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EXTPOLAR0</name>
							<description>External interrupt 0 EINT0 polarity.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FALLING_EDGE</name>
									<description>Falling edge. EINT0 is low-active or falling-edge sensitive (depending on EXTMODE0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE</name>
									<description>Rising edge. EINT0 is high-active or rising-edge sensitive (depending on EXTMODE0).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTPOLAR1</name>
							<description>External interrupt 1 EINT1 polarity.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FALLING_EDGE</name>
									<description>Falling edge. EINT1 is low-active or falling-edge sensitive (depending on EXTMODE1).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE</name>
									<description>Rising edge. EINT1 is high-active or rising-edge sensitive (depending on EXTMODE1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTPOLAR2</name>
							<description>External interrupt 2 EINT2 polarity.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FALLING_EDGE</name>
									<description>Falling edge. EINT2 is low-active or falling-edge sensitive (depending on EXTMODE2).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE</name>
									<description>Rising edge. EINT2 is high-active or rising-edge sensitive (depending on EXTMODE2).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTPOLAR3</name>
							<description>External interrupt 3 EINT3 polarity.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FALLING_EDGE</name>
									<description>Falling edge. EINT3 is low-active or falling-edge sensitive (depending on EXTMODE3).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE</name>
									<description>Rising edge. EINT3 is high-active or rising-edge sensitive (depending on EXTMODE3).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RSID</name>
					<description>Reset Source Identification Register</description>
					<addressOffset>0x180</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>POR</name>
							<description>Assertion of the POR signal sets this bit, and clears all of the other bits in this register. But if another Reset signal (e.g., External Reset) remains asserted after the POR signal is negated, then its bit is set. This bit is not affected by any of the other sources of Reset.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EXTR</name>
							<description>Assertion of the RESET signal sets this bit. This bit is cleared only by software or POR.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>WDTR</name>
							<description>This bit is set when the Watchdog Timer times out and the WDTRESET bit in the Watchdog Mode Register is 1. This bit is cleared only by software or POR.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>BODR</name>
							<description>This bit is set when the VDD(REG)(3V3) voltage reaches a level below the BOD reset trip level (typically 1.85 V under nominal room temperature conditions). If the VDD(REG)(3V3) voltage dips from the normal operating range to below the BOD reset trip level and recovers, the BODR bit will be set to 1. If the VDD(REG)(3V3) voltage dips from the normal operating range to below the BOD reset trip level and continues to decline to the level at which POR is asserted (nominally 1 V), the BODR bit is cleared. If the VDD(REG)(3V3) voltage rises continuously from below 1 V to a level above the BOD reset trip level, the BODR will be set to 1. This bit is cleared only by software or POR. Note: Only in the case where a reset occurs and the POR = 0, the BODR bit indicates if the VDD(REG)(3V3) voltage was below the BOD reset trip level or not.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SCS</name>
					<description>System control and status</description>
					<addressOffset>0x1A0</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. User software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>OSCRANGE</name>
							<description>Main oscillator range select.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>Low. The frequency range of the main oscillator is 1 MHz to 20 MHz.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>High. The frequency range of the main oscillator is 15 MHz to 25 MHz.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCEN</name>
							<description>Main oscillator enable.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The main oscillator is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled.The main oscillator is enabled, and will start up if the correct external circuitry is connected to the XTAL1 and XTAL2 pins.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCSTAT</name>
							<description>Main oscillator status.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_READY</name>
									<description>Not ready. The main oscillator is not ready to be used as a clock source.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>READY</name>
									<description>Ready. The main oscillator is ready to be used as a clock source. The main oscillator must be enabled via the OSCEN bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. User software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:7]</bitRange>
						</field>
					</fields>
				</register>
