itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>PCLKSEL0</name>
					<description>Peripheral Clock Selection register 0.</description>
					<addressOffset>0x1A8</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PCLK_WDT</name>
							<description>Peripheral clock selection for WDT.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_8</name>
									<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLK_TIMER0</name>
							<description>Peripheral clock selection for TIMER0.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_8</name>
									<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLK_TIMER1</name>
							<description>Peripheral clock selection for TIMER1.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_8</name>
									<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLK_UART0</name>
							<description>Peripheral clock selection for UART0.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_8</name>
									<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLK_UART1</name>
							<description>Peripheral clock selection for UART1.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_8</name>
									<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[11:10]</bitRange>
						</field>
						<field>
							<name>PCLK_PWM1</name>
							<description>Peripheral clock selection for PWM1.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_8</name>
									<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLK_I2C0</name>
							<description>Peripheral clock selection for I2C0.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_8</name>
									<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLK_SPI</name>
							<description>Peripheral clock selection for SPI.</description>
							<bitRange>[17:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_8</name>
									<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[19:18]</bitRange>
						</field>
						<field>
							<name>PCLK_SSP1</name>
							<description>Peripheral clock selection for SSP1.</description>
							<bitRange>[21:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_8</name>
									<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLK_DAC</name>
							<description>Peripheral clock selection for DAC.</description>
							<bitRange>[23:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_8</name>
									<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLK_ADC</name>
							<description>Peripheral clock selection for ADC.</description>
							<bitRange>[25:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_8</name>
									<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLK_CAN1</name>
							<description>Peripheral clock selection for CAN1.PCLK_CAN1 and PCLK_CAN2 must have the same PCLK divide value when the CAN function is used.</description>
							<bitRange>[27:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_6</name>
									<description>CCLK div 6. PCLK_peripheral = CCLK/6.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLK_CAN2</name>
							<description>Peripheral clock selection for CAN2.PCLK_CAN1 and PCLK_CAN2 must have the same PCLK divide value when the CAN function is used.</description>
							<bitRange>[29:28]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_6</name>
									<description>CCLK div 6. PCLK_peripheral = CCLK/6,</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLK_ACF</name>
							<description>Peripheral clock selection for CAN acceptance filtering.PCLK_CAN1 and PCLK_CAN2 must have the same PCLK divide value when the CAN function is used.</description>
							<bitRange>[31:30]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCLK_DIV_4</name>
									<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK</name>
									<description>CCLK. PCLK_peripheral = CCLK</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_2</name>
									<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCLK_DIV_6</name>
									<description>CCLK div 6. PCLK_peripheral = CCLK/6</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
