itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>SOFTLSREQ</name>
					<description>DMA Software Last Single Request Register</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SOFTLSREQ0</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ1</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ2</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ3</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ4</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ5</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ6</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ7</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ8</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ9</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ10</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ11</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ12</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ13</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ14</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>SOFTLSREQ15</name>
							<description>Software last single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA last single transfer request for the corresponding request line.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CONFIG</name>
					<description>DMA Configuration Register</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>E</name>
							<description>DMA Controller enable: 0 = disabled (default). Disabling the DMA Controller reduces power consumption. 1 = enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>M</name>
							<description>AHB Master endianness configuration: 0 = little-endian mode (default). 1 = big-endian mode.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SYNC</name>
					<description>DMA Synchronization Register</description>
					<addressOffset>0x034</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DMACSYNC0</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DMACSYNC1</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>DMACSYNC2</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DMACSYNC3</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DMACSYNC4</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>DMACSYNC5</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>DMACSYNC6</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>DMACSYNC7</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>DMACSYNC8</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DMACSYNC9</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>DMACSYNC10</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>DMACSYNC11</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>DMACSYNC12</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>DMACSYNC13</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>DMACSYNC14</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>DMACSYNC15</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are enabled. 1 - synchronization logic for the corresponding DMA request signals are disabled.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>SRCADDR%s</name>
					<description>DMA Channel 0 Source Address Register</description>
					<addressOffset>0x100</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SRCADDR</name>
							<description>DMA source address. Reading this register will return the current source address.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>DESTADDR%s</name>
					<description>DMA Channel 0 Destination Address Register</description>
					<addressOffset>0x104</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DESTADDR</name>
							<description>DMA Destination address. Reading this register will return the current destination address.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>LLI%s</name>
					<description>DMA Channel 0 Linked List Item Register</description>
					<addressOffset>0x108</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, and must be written as 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>LLI</name>
							<description>Linked list item. Bits [31:2] of the address for the next LLI. Address bits [1:0] are 0.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>CONTROL%s</name>
					<description>DMA Channel 0 Control Register</description>
					<addressOffset>0x10C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRANSFERSIZE</name>
							<description>Transfer size. This field sets the size of the transfer when the DMA controller is the flow controller, in which case the value must be set before the channel is enabled. Transfer size is updated as data transfers are completed. A read from this field indicates the number of transfers completed on the destination bus. Reading the register when the channel is active does not give useful information because by the time that the software has processed the value read, the channel might have progressed. It is intended to be used only when a channel is enabled and then disabled. The transfer size value is not used if a peripheral is the flow controller.</description>
							<bitRange>[11:0]</bitRange>
						</field>
						<field>
							<name>SBSIZE</name>
							<description>Source burst size. Indicates the number of transfers that make up a source burst. This value must be set to the burst size of the source peripheral, or if the source is memory, to the memory boundary size. The burst size is the amount of data that is transferred when the DMACBREQ signal goes active in the source peripheral. 000 - 1 001 - 4 010 - 8 011 - 16 100 - 32 101 - 64 110 - 128 111 - 256</description>
							<bitRange>[14:12]</bitRange>
						</field>
						<field>
							<name>DBSIZE</name>
							<description>Destination burst size. Indicates the number of transfers that make up a destination burst transfer request. This value must be set to the burst size of the destination peripheral or, if the destination is memory, to the memory boundary size. The burst size is the amount of data that is transferred when the DMACBREQ signal goes active in the destination peripheral. 000 - 1 001 - 4 010 - 8 011 - 16 100 - 32 101 - 64 110 - 128 111 - 256</description>
							<bitRange>[17:15]</bitRange>
						</field>
						<field>
							<name>SWIDTH</name>
							<description>Source transfer width. The source and destination widths can be different from each other. The hardware automatically packs and unpacks the data as required. 000 - Byte (8-bit) 001 - Halfword (16-bit) 010 - Word (32-bit) 011 to 111 - Reserved</description>
							<bitRange>[20:18]</bitRange>
						</field>
						<field>
							<name>DWIDTH</name>
							<description>Destination transfer width. The source and destination widths can be different from each other. The hardware automatically packs and unpacks the data as required. 000 - Byte (8-bit) 001 - Halfword (16-bit) 010 - Word (32-bit) 011 to 111 - Reserved</description>
							<bitRange>[23:21]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, and must be written as 0.</description>
							<bitRange>[25:24]</bitRange>
						</field>
						<field>
							<name>SI</name>
							<description>Source increment: 0 - the source address is not incremented after each transfer. 1 - the source address is incremented after each transfer.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>DI</name>
							<description>Destination increment: 0 - the destination address is not incremented after each transfer. 1 - the destination address is incremented after each transfer.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>PROT1</name>
							<description>This is provided to the peripheral during a DMA bus access and indicates that the access is in user mode or privileged mode. This information is not used in the LPC178x/177x. 0 - access is in user mode. 1 - access is in privileged mode.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>PROT2</name>
							<description>This is provided to the peripheral during a DMA bus access and indicates to the peripheral that the access is bufferable or not bufferable. This information is not used in the LPC178x/177x. 0 - access is not bufferable. 1 - access is bufferable.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>PROT3</name>
							<description>This is provided to the peripheral during a DMA bus access and indicates to the peripheral that the access is cacheable or not cacheable. This information is not used in the LPC178x/177x. 0 - access is not cacheable. 1 - access is cacheable.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>I</name>
							<description>Terminal count interrupt enable bit. 0 - the terminal count interrupt is disabled. 1 - the terminal count interrupt is enabled.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
