itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>DEVINTCLR</name>
					<description>USB Device Interrupt Clear</description>
					<addressOffset>0x208</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAMECLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EP_FASTCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EP_SLOWCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DEV_STATCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CCEMPTYCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CDFULLCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RxENDPKTCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>TxENDPKTCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EP_RLZEDCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>ERR_INTCLR</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVINTSET</name>
					<description>USB Device Interrupt Set</description>
					<addressOffset>0x20C</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAMESET</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EP_FASTSET</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EP_SLOWSET</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DEV_STATSET</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CCEMPTYSET</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CDFULLSET</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RxENDPKTSET</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>TxENDPKTSET</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EP_RLZEDSET</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>ERR_INTSET</name>
							<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CMDCODE</name>
					<description>USB Command Code</description>
					<addressOffset>0x210</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>CMD_PHASE</name>
							<description>The command phase:</description>
							<bitRange>[15:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>READ</name>
									<description>Read</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITE</name>
									<description>Write</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COMMAND</name>
									<description>Command</description>
									<value>0x05</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMD_CODE_WDATA</name>
							<description>This is a multi-purpose field. When CMD_PHASE is Command or Read, this field contains the code for the command (CMD_CODE). When CMD_PHASE is Write, this field contains the command write data (CMD_WDATA).</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CMDDATA</name>
					<description>USB Command Data</description>
					<addressOffset>0x214</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMD_RDATA</name>
							<description>Command Read Data.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RXDATA</name>
					<description>USB Receive Data</description>
					<addressOffset>0x218</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RX_DATA</name>
							<description>Data received.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDATA</name>
					<description>USB Transmit Data</description>
					<addressOffset>0x21C</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TX_DATA</name>
							<description>Transmit Data.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RXPLEN</name>
					<description>USB Receive Packet Length</description>
					<addressOffset>220</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PKT_LNGTH</name>
							<description>The remaining number of bytes to be read from the currently selected endpoint's buffer. When this field decrements to 0, the RxENDPKT bit will be set in USBDevIntSt.</description>
							<bitRange>[9:0]</bitRange>
						</field>
						<field>
							<name>DV</name>
							<description>Data valid. This bit is useful for isochronous endpoints. Non-isochronous endpoints do not raise an interrupt when an erroneous data packet is received. But invalid data packet can be produced with a bus reset. For isochronous endpoints, data transfer will happen even if an erroneous packet is received. In this case DV bit will not be set for the packet.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DATA_IS_INVALID_</name>
									<description>Data is invalid.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA_IS_VALID_</name>
									<description>Data is valid.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PKT_RDY</name>
							<description>The PKT_LNGTH field is valid and the packet is ready for reading.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TXPLEN</name>
					<description>USB Transmit Packet Length</description>
					<addressOffset>0x224</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PKT_LNGTH</name>
							<description>The remaining number of bytes to be written to the selected endpoint buffer. This field is decremented by 4 by hardware after each write to USBTxData. When this field decrements to 0, the TxENDPKT bit will be set in USBDevIntSt.</description>
							<bitRange>[9:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>USB Control</description>
					<addressOffset>0x228</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RD_EN</name>
							<description>Read mode control. Enables reading data from the OUT endpoint buffer for the endpoint specified in the LOG_ENDPOINT field using the USBRxData register. This bit is cleared by hardware when the last word of the current packet is read from USBRxData.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED_</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WR_EN</name>
							<description>Write mode control. Enables writing data to the IN endpoint buffer for the endpoint specified in the LOG_ENDPOINT field using the USBTxData register. This bit is cleared by hardware when the number of bytes in USBTxLen have been sent.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED_</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOG_ENDPOINT</name>
							<description>Logical Endpoint number.</description>
							<bitRange>[5:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVINTPRI</name>
					<description>USB Device Interrupt Priority</description>
					<addressOffset>0x22C</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAME</name>
							<description>Frame interrupt routing</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LP</name>
									<description>FRAME interrupt is routed to USB_INT_REQ_LP.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HP</name>
									<description>FRAME interrupt is routed to USB_INT_REQ_HP.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EP_FAST</name>
							<description>Fast endpoint interrupt routing</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LP</name>
									<description>EP_FAST interrupt is routed to USB_INT_REQ_LP.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HP</name>
									<description>EP_FAST interrupt is routed to USB_INT_REQ_HP.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EPINTST</name>
					<description>USB Endpoint Interrupt Status</description>
					<addressOffset>0x230</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPST0</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EPST1</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EPST2</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EPST3</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>EPST4</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>EPST5</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>EPST6</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>EPST7</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EPST8</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>EPST9</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>EPST10</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>EPST11</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>EPST12</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>EPST13</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>EPST14</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>EPST15</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>EPST16</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>EPST17</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>EPST18</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>EPST19</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>EPST20</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>EPST21</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>EPST22</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>EPST23</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>EPST24</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>EPST25</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>EPST26</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>EPST27</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>EPST28</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>EPST29</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>EPST30</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>EPST31</name>
							<description>1 = Endpoint Data Received (bits 0, 2, 4, ..., 30) or Transmitted (bits 1, 3, 5, ..., 31) Interrupt received.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
