itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>NDDRINTSET</name>
					<description>USB New DD Request Interrupt Set</description>
					<addressOffset>0x2B4</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPNDDINTSET0</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET1</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET2</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET3</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET4</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET5</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET6</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET7</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET8</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET9</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET10</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET11</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET12</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET13</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET14</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET15</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET16</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET17</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET18</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET19</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET20</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET21</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET22</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET23</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET24</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET25</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET26</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET27</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET28</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET29</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET30</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>EPNDDINTSET31</name>
							<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) new DD interrupt request. 0 = No effect. 1 = Set the EPxx new DD interrupt request in the USBNDDRIntSt register.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSERRINTST</name>
					<description>USB System Error Interrupt Status</description>
					<addressOffset>0x2B8</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EPERRINTST0</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EPERRINTST1</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EPERRINTST2</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EPERRINTST3</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>EPERRINTST4</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>EPERRINTST5</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>EPERRINTST6</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>EPERRINTST7</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EPERRINTST8</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>EPERRINTST9</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>EPERRINTST10</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>EPERRINTST11</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>EPERRINTST12</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>EPERRINTST13</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>EPERRINTST14</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>EPERRINTST15</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>EPERRINTST16</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>EPERRINTST17</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>EPERRINTST18</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>EPERRINTST19</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>EPERRINTST20</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>EPERRINTST21</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>EPERRINTST22</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>EPERRINTST23</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>EPERRINTST24</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>EPERRINTST25</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>EPERRINTST26</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>EPERRINTST27</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>EPERRINTST28</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>EPERRINTST29</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>EPERRINTST30</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>EPERRINTST31</name>
							<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
