itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>OTGCLKST</name>
					<description>OTG clock status</description>
					<alternateRegister>USBCLKST</alternateRegister>
					<addressOffset>0xFF8</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HOST_CLK_ON</name>
							<description>Host clock status.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>HOST_CLOCK_IS_NOT_AV</name>
									<description>Host clock is not available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HOST_CLOCK_IS_AVAILA</name>
									<description>Host clock is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DEV_CLK_ON</name>
							<description>Device clock status.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DEVICE_CLOCK_IS_NOT_</name>
									<description>Device clock is not available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEVICE_CLOCK_IS_AVAI</name>
									<description>Device clock is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2C_CLK_ON</name>
							<description>I2C clock status.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>I2C_CLOCK_IS_NOT_AVA</name>
									<description>I2C clock is not available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C_CLOCK_IS_AVAILAB</name>
									<description>I2C clock is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OTG_CLK_ON</name>
							<description>OTG clock status.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>OTG_CLOCK_IS_NOT_AVA</name>
									<description>OTG clock is not available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OTG_CLOCK_IS_AVAILAB</name>
									<description>OTG clock is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AHB_CLK_ON</name>
							<description>AHB master clock status.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AHB_CLOCK_IS_NOT_AVA</name>
									<description>AHB clock is not available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AHB_CLOCK_IS_AVAILAB</name>
									<description>AHB clock is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>GPIO0</name>
			<description>General Purpose I/O</description>
			<groupName>GPIO</groupName>
			<baseAddress>0x2009C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x020</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DIR</name>
					<description>GPIO Port Direction control register.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PINDIR0</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>PINDIR1</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>PINDIR2</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>PINDIR3</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>PINDIR4</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>PINDIR5</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>PINDIR6</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>PINDIR7</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>PINDIR8</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>PINDIR9</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>PINDIR10</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>PINDIR11</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>PINDIR12</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>PINDIR13</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>PINDIR14</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>PINDIR15</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>PINDIR16</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>PINDIR17</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>PINDIR18</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>PINDIR19</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>PINDIR20</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>PINDIR21</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>PINDIR22</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>PINDIR23</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>PINDIR24</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>PINDIR25</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>PINDIR26</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>PINDIR27</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>PINDIR28</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>PINDIR29</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>PINDIR30</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>PINDIR31</name>
							<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
