itzandroidtab/klib-svd/lpc1756.svd
				<register>
					<name>PIN</name>
					<description>Port Pin value register using FIOMASK.</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PINVAL0</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>PINVAL1</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>PINVAL2</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>PINVAL3</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>PINVAL4</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>PINVAL5</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>PINVAL6</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>PINVAL7</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>PINVAL8</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>PINVAL9</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>PINVAL10</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>PINVAL11</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>PINVAL12</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>PINVAL13</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>PINVAL14</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>PINVAL15</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>PINVAL16</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>PINVAL17</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>PINVAL18</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>PINVAL19</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>PINVAL20</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>PINVAL21</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>PINVAL22</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>PINVAL23</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>PINVAL24</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>PINVAL25</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>PINVAL26</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>PINVAL27</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>PINVAL28</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>PINVAL29</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>PINVAL30</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>PINVAL31</name>
							<description>Fast GPIO output value Set bits. Bit 0 in PINx corresponds to pin Px[0], bit 31 in PINx corresponds to pin Px[31]. 0 = Controlled pin output is set to LOW. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SET</name>
					<description>Port Output Set register using FIOMASK.</description>
					<addressOffset>0x018</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PINSET0</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>PINSET1</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>PINSET2</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>PINSET3</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>PINSET4</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>PINSET5</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>PINSET6</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>PINSET7</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>PINSET8</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>PINSET9</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>PINSET10</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>PINSET11</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>PINSET12</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>PINSET13</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>PINSET14</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>PINSET15</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>PINSET16</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>PINSET17</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>PINSET18</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>PINSET19</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>PINSET20</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>PINSET21</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>PINSET22</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>PINSET23</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>PINSET24</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>PINSET25</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>PINSET26</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>PINSET27</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>PINSET28</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>PINSET29</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>PINSET30</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>PINSET31</name>
							<description>Fast GPIO output value Set bits. Bit 0 in SETx controls pin Px[0], bit 31 in SETx controls pin Px[31]. 0 = Controlled pin output is unchanged. 1 = Controlled pin output is set to HIGH.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
